BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
// CRC: 5D982BB222882C54AB4AFF20A1590FC484D3178BD0D2510D0F5A64A7853221CAE2C33FABBE4F69A6659399D51781B7B96B2CA784FFAB0B31469AD0B2DE0C4AE7F354AA71734CF0DA1345D4F62132DD03562AF2F62E9AB6760C3CAEE8E7DA6987D6CFCA890B0101BEFC26F6046DEEE1BDC289C1AC3D44D4438C6CD581AF9C057043214DA6C569CDAAD938365A0B1E94A4D7FA7622D65226135C23DCFB6B9176E26EDAC1A7CB13B6620F41C431DF4F39CEA234862CBD14D6A7549D34A0D5AD11F3B0E7FE5A41EF69FD674885F709F626952F9D03BEA8F75AF1A3608A0B0CE69F969622A912E6E6A2FB
// REVISION: 2.0
// GUID: B2E7FADF-EF51-464D-8DD4-293A82E94B3D
// DATE: 18\12\2025
// DIR: CAL\PIC16BIT\PIC16BIT_CAL_CAN.c
/*********************************************************************
 *                  Flowcode CAL CAN File
 *
 * File: PIC16BIT_CAL_CAN.c
 *
 * (c) 2011 Matrix Multimedia Ltd.
 * http://www.matrixmultimedia.com
 *
 * Software License Agreement
 *
 * The software supplied herewith by Matrix Multimedia Ltd (the
 * Company) for its Flowcode graphical programming language is
 * intended and supplied to you, the Companys customer, for use
 * solely and exclusively on the Company's products. The software
 * is owned by the Company, and is protected under applicable
 * copyright laws. All rights are reserved. Any use in violation
 * of the foregoing restrictions may subject the user to criminal
 * sanctions under applicable laws, as well as to civil liability
 * for the breach of the terms and conditions of this licence.
 *
 * THIS SOFTWARE IS PROVIDED IN AN AS IS CONDITION. NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 * IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * Changelog:
 *
 *  date  | by | description
 * -------+----+-----------------------------------------------------
 * 230911 | BR | Created
 * 020312 | BR | Updated to v5.1 CAL Schema
 * 101012 | BR | Fixed a bug where the config mode bits were not defined correctly
 * 111012 | LM | Added initialization value for CANCTRL (and fixed typo)
 * 030713 | LM | Standard API calls
 * 110913 | LM | Change to unified config for id, mask and filter setting
 * 020614 | JK | Add support for ECAN controllers in dsPIC33 series
 */


#ifndef MX_ECAN
	#error "Internal CAN not supported on this device"
#else


#define MX_CAN_CHANNEL_X		CAL_APPEND(MX_CAN_CHANNEL_, MX_CAN_NUM)
#define MX_CAN_BAUD1_X			CAL_APPEND(MX_CAN_BAUD1_, MX_CAN_NUM)
#define MX_CAN_BAUD2_X			CAL_APPEND(MX_CAN_BAUD2_, MX_CAN_NUM)
#define MX_CAN_BAUD3_X			CAL_APPEND(MX_CAN_BAUD3_, MX_CAN_NUM)

#define MX_CAN_EXID_X			CAL_APPEND(MX_CAN_EXID_, MX_CAN_NUM)

#define MX_CAN_RXB0CFG_X		CAL_APPEND(MX_CAN_RXB0CFG_, MX_CAN_NUM)
#define MX_CAN_RXB1CFG_X		CAL_APPEND(MX_CAN_RXB1CFG_, MX_CAN_NUM)

#define MX_CAN_RXM0_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXM0_, MX_CAN_NUM)
#define MX_CAN_RXM1_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXM1_, MX_CAN_NUM)

#define MX_CAN_RXF0_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXF0_, MX_CAN_NUM)
#define MX_CAN_RXF1_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXF1_, MX_CAN_NUM)
#define MX_CAN_RXF2_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXF2_, MX_CAN_NUM)
#define MX_CAN_RXF3_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXF3_, MX_CAN_NUM)
#define MX_CAN_RXF4_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXF4_, MX_CAN_NUM)
#define MX_CAN_RXF5_X			(MX_UINT32)CAL_APPEND(MX_CAN_RXF5_, MX_CAN_NUM)

#define MX_CAN_TXB0ID_X			(MX_UINT32)CAL_APPEND(MX_CAN_TXB0ID_, MX_CAN_NUM)
#define MX_CAN_TXB0LEN_X		CAL_APPEND(MX_CAN_TXB0LEN_, MX_CAN_NUM)
#define MX_CAN_TXB0DB0_X		CAL_APPEND(MX_CAN_TXB0DB0_, MX_CAN_NUM)
#define MX_CAN_TXB0DB1_X		CAL_APPEND(MX_CAN_TXB0DB1_, MX_CAN_NUM)
#define MX_CAN_TXB0DB2_X		CAL_APPEND(MX_CAN_TXB0DB2_, MX_CAN_NUM)
#define MX_CAN_TXB0DB3_X		CAL_APPEND(MX_CAN_TXB0DB3_, MX_CAN_NUM)
#define MX_CAN_TXB0DB4_X		CAL_APPEND(MX_CAN_TXB0DB4_, MX_CAN_NUM)
#define MX_CAN_TXB0DB5_X		CAL_APPEND(MX_CAN_TXB0DB5_, MX_CAN_NUM)
#define MX_CAN_TXB0DB6_X		CAL_APPEND(MX_CAN_TXB0DB6_, MX_CAN_NUM)
#define MX_CAN_TXB0DB7_X		CAL_APPEND(MX_CAN_TXB0DB7_, MX_CAN_NUM)

#define MX_CAN_TXB1ID_X			(MX_UINT32)CAL_APPEND(MX_CAN_TXB1ID_, MX_CAN_NUM)
#define MX_CAN_TXB1LEN_X		CAL_APPEND(MX_CAN_TXB1LEN_, MX_CAN_NUM)
#define MX_CAN_TXB1DB0_X		CAL_APPEND(MX_CAN_TXB1DB0_, MX_CAN_NUM)
#define MX_CAN_TXB1DB1_X		CAL_APPEND(MX_CAN_TXB1DB1_, MX_CAN_NUM)
#define MX_CAN_TXB1DB2_X		CAL_APPEND(MX_CAN_TXB1DB2_, MX_CAN_NUM)
#define MX_CAN_TXB1DB3_X		CAL_APPEND(MX_CAN_TXB1DB3_, MX_CAN_NUM)
#define MX_CAN_TXB1DB4_X		CAL_APPEND(MX_CAN_TXB1DB4_, MX_CAN_NUM)
#define MX_CAN_TXB1DB5_X		CAL_APPEND(MX_CAN_TXB1DB5_, MX_CAN_NUM)
#define MX_CAN_TXB1DB6_X		CAL_APPEND(MX_CAN_TXB1DB6_, MX_CAN_NUM)
#define MX_CAN_TXB1DB7_X		CAL_APPEND(MX_CAN_TXB1DB7_, MX_CAN_NUM)

#define MX_CAN_TXB2ID_X			(MX_UINT32)CAL_APPEND(MX_CAN_TXB2ID_, MX_CAN_NUM)
#define MX_CAN_TXB2LEN_X		CAL_APPEND(MX_CAN_TXB2LEN_, MX_CAN_NUM)
#define MX_CAN_TXB2DB0_X		CAL_APPEND(MX_CAN_TXB2DB0_, MX_CAN_NUM)
#define MX_CAN_TXB2DB1_X		CAL_APPEND(MX_CAN_TXB2DB1_, MX_CAN_NUM)
#define MX_CAN_TXB2DB2_X		CAL_APPEND(MX_CAN_TXB2DB2_, MX_CAN_NUM)
#define MX_CAN_TXB2DB3_X		CAL_APPEND(MX_CAN_TXB2DB3_, MX_CAN_NUM)
#define MX_CAN_TXB2DB4_X		CAL_APPEND(MX_CAN_TXB2DB4_, MX_CAN_NUM)
#define MX_CAN_TXB2DB5_X		CAL_APPEND(MX_CAN_TXB2DB5_, MX_CAN_NUM)
#define MX_CAN_TXB2DB6_X		CAL_APPEND(MX_CAN_TXB2DB6_, MX_CAN_NUM)
#define MX_CAN_TXB2DB7_X		CAL_APPEND(MX_CAN_TXB2DB7_, MX_CAN_NUM)

#define MX_CAN_MSG_DLC_X		CAL_APPEND(MX_CAN_MSG_DLC_, MX_CAN_NUM)
#define MX_CAN_MSG_DATA_X		CAL_APPEND(MX_CAN_MSG_DATA_, MX_CAN_NUM)
#define MX_CAN_MSG_ID_X			CAL_APPEND(MX_CAN_MSG_ID_, MX_CAN_NUM)


#ifndef REQOP_CONFIG
  #define REQOP_CONFIG		0x04
  #define REQOP_LISTEN		0x03
  #define REQOP_LOOPBACK	0x02
  #define REQOP_SLEEP		0x01
  #define REQOP_NORMAL		0x00
#endif

#ifndef MX_CAN_INT_DEFS
  #define MX_CAN_INT_DEFS
  #define CAN_OP_MODE_BITS 		0xE0

  #define MX_CAN_RXESID(v) ((v >> 16) | 1)
  #define MX_CAN_RXEIDL(v) (v << 10)
  #define MX_CAN_RXEIDH(v) (v >> 6)
  #define MX_CAN_TXESID(v) ((((v&0x1F000000) >> 13)|((v&0xFC0000) >> 16)) | 1)
  #define MX_CAN_TXEEID(v) (((v&0x3C000) >> 2)|((v&0x3FC0) >> 6))
  #define MX_CAN_TXEDLC(v) (v << 10)

  #define MX_CAN_RXSSID(v) (v << 2)
  #define MX_CAN_TXSSID(v) (((v&0x7C0) << 5)|((v&0x3F) << 2))

  #define C1CTRL_VAL  0x0800		// set CAN CKS
  #define C2CTRL_VAL  0x0800		// set CAN CKS

  #define TXB0CTRL_VAL 0
  #define TXB1CTRL_VAL 0
  #define TXB2CTRL_VAL 0

  #define RXB0CTRL_VAL 0
  #define RXB1CTRL_VAL 0

  /**
   * Not directly supported by this family CAN controller
   * Set Mask and Filter for desired result
  #define MX_CAN_REJECT_ALL 	(0)
  #define MX_CAN_USE_FILTERS	(1)
  #define MX_CAN_ACCEPT_ALL 	(2)
  **/

