BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
#endif // MX_CAN_INT_DEFS

MX_UINT8 MX_CAN_MSG_DLC_X;
MX_UINT8 MX_CAN_MSG_DATA_X[8];
#if defined (__dsPIC33E__) || defined (__PIC24E__) || defined (__dsPIC33F__) || defined (__PIC24H__)
	// For dsPIC33 now use a MX_UINT32
	MX_UINT32 MX_CAN_MSG_ID_X;
#else
MX_UINT8 MX_CAN_MSG_ID_X[4];
#endif

//Function Prototypes
CALFUNCTION(void, FC_CAL_Internal_CAN_Init_, (void));
CALFUNCTION(void, FC_CAL_Internal_CAN_Uninit_, (void));
CALFUNCTION(void, FC_CAL_Internal_CAN_SendBuffer_, (MX_UINT8 buffer));
CALFUNCTION(MX_UINT8, FC_CAL_Internal_CAN_CheckRx_, (MX_UINT8 buffer));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxData_, (MX_UINT8 buffer, MX_UINT8 data_cnt, MX_UINT8 d0, MX_UINT8 d1, MX_UINT8 d2, MX_UINT8 d3, MX_UINT8 d4, MX_UINT8 d5, MX_UINT8 d6, MX_UINT8 d7));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxIdentStd_, (MX_UINT8 buffer, MX_UINT8 hi, MX_UINT8 lo));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxIdentExd_, (MX_UINT8 buffer, MX_UINT8 id3, MX_UINT8 id2, MX_UINT8 id1, MX_UINT8 id0));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxFilterStd_, (MX_UINT8 filter, MX_UINT8 hi, MX_UINT8 lo));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxFilterExd_, (MX_UINT8 filter, MX_UINT8 id3, MX_UINT8 id2, MX_UINT8 id1, MX_UINT8 id0));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxMaskStd_, (MX_UINT8 filter, MX_UINT8 hi, MX_UINT8 lo));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxMaskExd_, (MX_UINT8 filter, MX_UINT8 id3, MX_UINT8 id2, MX_UINT8 id1, MX_UINT8 id0));

CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxMask_, (MX_UINT8 mask, MX_UINT32 id));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxFilter_, (MX_UINT8 filter, MX_UINT32 id));
CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxIdent_, (MX_UINT8 buffer, MX_UINT32 id));
CALFUNCTION(MX_UINT32, FC_CAL_Internal_CAN_GetRxIdent_, (MX_UINT8 buffer));
CALFUNCTION(MX_UINT8, FC_CAL_Internal_CAN_GetRxDataCount_, (MX_UINT8 buffer));
CALFUNCTION(MX_UINT8, FC_CAL_Internal_CAN_GetRxData_, (MX_UINT8 buffer, MX_UINT8 index));

// Reserve DMA buffers for dsPIC33 family
#ifndef MX_30FCAN
#define	MX_MEMBUF_X	CAL_APPEND(MX_MEMBUF_, MX_CAN_NUM)
#define NUM_OF_CAN_BUFFERS 12

// Allocate 12 buffers, buffers 0,1,2 for transmit
// buffer 3 for 'RX Buffer 0'
// buffers 4-8 for 'RX Buffer 1', FIFO mode
#if defined (__dsPIC33E__) || defined (__PIC24E__) || defined (__dsPIC33F__) || defined (__PIC24H__)
  #if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
    __eds__ unsigned int MX_MEMBUF_X[NUM_OF_CAN_BUFFERS][8] __attribute__((eds,space(dma),aligned(16*16)));
  #else
	// The following attributes addition was a fix for dsPIC33EP128 MC502/MC506/MU806 ...
	// __eds__ unsigned int MX_MEMBUF_X[NUM_OF_CAN_BUFFERS][8] __attribute__((eds,aligned(16*16)));
	// But it seems to break dsPIC33EP512GM710 and a few others, so runs as this ...
	// (If we need it back, then add it as specific fixes)
	unsigned int MX_MEMBUF_X[NUM_OF_CAN_BUFFERS][8] __attribute__((aligned(16*16)));
  #endif
/***
  #ifndef FCV_DMA_BASE
    #define	FCV_DMA_BASE	1
  #endif
***/
#else
  #if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
    __eds__ unsigned int MX_MEMBUF_X[NUM_OF_CAN_BUFFERS][8] __attribute__((eds,space(dma),aligned(16*16)));
  #else
	__eds__ unsigned int MX_MEMBUF_X[NUM_OF_CAN_BUFFERS][8] __attribute__((eds,aligned(16*16)));
  #endif
#endif
#endif


CALFUNCTION(void, FC_CAL_Internal_CAN_Init_, (void))
{

	#if defined (__dsPIC33E__) || defined (__PIC24E__)
		MSTRPR = 0x20;		// DMA bug fix - make DMA top priority
	#endif


	#if (MX_CAN_CHANNEL_X == 1)

		//#ifndef dsPIC30	//Non dsPIC30F Device - Internal CAN different!!!
			//#error "Internal CAN is not supported in the device type. dsPIC30 only supported."
		//#endif

		// Remap pins
		#ifdef MX_CAN_1_REMAPPABLE
			MX_CAN_1_TX_RPOR = MX_CAN_1_TX_RPNUM;
			MX_CAN_1_RX_RPINR = MX_CAN_1_RX_RP;
		#endif

		#ifdef __dsPIC30F__	// dsPIC30F Device
			//configure CAN I/O - ds30F??

			C1CTRL = C1CTRL_VAL;

			// Request config mode.
			C1CTRLbits.REQOP = REQOP_CONFIG;

			// Wait till desired mode is set.
			while( C1CTRLbits.OPMODE != REQOP_CONFIG );

			// Now set the baud rate.
			C1CFG2 = MX_CAN_BAUD2_X | (MX_CAN_BAUD3_X << 8);
			C1CFG1 = MX_CAN_BAUD1_X;

			//Setup the CAN comms Masks and Filters
			#if (MX_CAN_EXID_X == 1)

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C1RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C1RXF0EIDL = 0xFFFF;
					C1RXF0EIDH = 0xFFFF;
					C1RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0
					C1RXF1EIDL = 0xFFFF;
					C1RXF1EIDH = 0xFFFF;
					C1RXM0SID = 0xFFFF;	// ID Mask 0 - Buffer 0
					C1RXM0EIDL = 0xFFFF;
					C1RXM0EIDH = 0xFFFF;

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					C1RXF0SID = MX_CAN_RXESID(MX_CAN_RXF0_X);	// ID Filter 0 - Buffer 0
					C1RXF0EIDL = MX_CAN_RXEIDL(MX_CAN_RXF0_X);
					C1RXF0EIDH = MX_CAN_RXEIDH(MX_CAN_RXF0_X);
					C1RXF1SID = MX_CAN_RXESID(MX_CAN_RXF1_X);	// ID Filter 1 - Buffer 0
					C1RXF1EIDL = MX_CAN_RXEIDL(MX_CAN_RXF1_X);
					C1RXF1EIDH = MX_CAN_RXEIDH(MX_CAN_RXF1_X);
					C1RXM0SID = MX_CAN_RXESID(MX_CAN_RXM0_X);	// ID Mask 0 - Buffer 0
					C1RXM0EIDL = MX_CAN_RXEIDL(MX_CAN_RXM0_X);
					C1RXM0EIDH = MX_CAN_RXEIDH(MX_CAN_RXM0_X);

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C1RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C1RXF0EIDL = 0xFFFF;
					C1RXF0EIDH = 0xFFFF;
					C1RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0
					C1RXF1EIDL = 0xFFFF;
					C1RXF1EIDH = 0xFFFF;
					C1RXM0SID = 0x0000;	// ID Mask 0 - Buffer 0
					C1RXM0EIDL = 0x0000;
					C1RXM0EIDH = 0x0000;

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C1RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C1RXF2EIDL = 0xFFFF;
					C1RXF2EIDH = 0xFFFF;
					C1RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C1RXF3EIDL = 0xFFFF;
					C1RXF3EIDH = 0xFFFF;
					C1RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C1RXF4EIDL = 0xFFFF;
					C1RXF4EIDH = 0xFFFF;
					C1RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1
					C1RXF5EIDL = 0xFFFF;
					C1RXF5EIDH = 0xFFFF;
					C1RXM1SID = 0xFFFF;	// ID Mask 1 - Buffer 1
					C1RXM1EIDL = 0xFFFF;
					C1RXM1EIDH = 0xFFFF;

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

