BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
					C1RXF2SID = MX_CAN_RXESID(MX_CAN_RXF2_X);	// ID Filter 2 - Buffer 1
					C1RXF2EIDL = MX_CAN_RXEIDL(MX_CAN_RXF2_X);
					C1RXF2EIDH = MX_CAN_RXEIDH(MX_CAN_RXF2_X);
					C1RXF3SID = MX_CAN_RXESID(MX_CAN_RXF3_X);	// ID Filter 3 - Buffer 1
					C1RXF3EIDL = MX_CAN_RXEIDL(MX_CAN_RXF3_X);
					C1RXF3EIDH = MX_CAN_RXEIDH(MX_CAN_RXF3_X);
					C1RXF4SID = MX_CAN_RXESID(MX_CAN_RXF4_X);	// ID Filter 4 - Buffer 1
					C1RXF4EIDL = MX_CAN_RXEIDL(MX_CAN_RXF4_X);
					C1RXF4EIDH = MX_CAN_RXEIDH(MX_CAN_RXF4_X);
					C1RXF5SID = MX_CAN_RXESID(MX_CAN_RXF5_X);	// ID Filter 5 - Buffer 1
					C1RXF5EIDL = MX_CAN_RXEIDL(MX_CAN_RXF5_X);
					C1RXF5EIDH = MX_CAN_RXEIDH(MX_CAN_RXF5_X);
					C1RXM1SID = MX_CAN_RXESID(MX_CAN_RXM1_X);	// ID Mask 1 - Buffer 1
					C1RXM1EIDL = MX_CAN_RXEIDL(MX_CAN_RXM1_X);
					C1RXM1EIDH = MX_CAN_RXEIDH(MX_CAN_RXM1_X);

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

					C1RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C1RXF2EIDL = 0xFFFF;
					C1RXF2EIDH = 0xFFFF;
					C1RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C1RXF3EIDL = 0xFFFF;
					C1RXF3EIDH = 0xFFFF;
					C1RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C1RXF4EIDL = 0xFFFF;
					C1RXF4EIDH = 0xFFFF;
					C1RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1
					C1RXF5EIDL = 0xFFFF;
					C1RXF5EIDH = 0xFFFF;
					C1RXM1SID = 0x0000;	// ID Mask 1 - Buffer 1
					C1RXM1EIDL = 0x0000;
					C1RXM1EIDH = 0x0000;

				#endif

			#else

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C1RXM0SID = 0xFFFF;	// ID Mask 0 - Buffer 0
					C1RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C1RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					C1RXM0SID = MX_CAN_RXSSID(MX_CAN_RXM0_X);	// ID Mask 0 - Buffer 0
					C1RXF0SID = MX_CAN_RXSSID(MX_CAN_RXF0_X);	// ID Filter 0 - Buffer 0
					C1RXF1SID = MX_CAN_RXSSID(MX_CAN_RXF1_X);	// ID Filter 1 - Buffer 0

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C1RXM0SID = 0x0000;	// ID Mask 0 - Buffer 0
					C1RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C1RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C1RXM1SID = 0xFFFF;	// ID Mask 1 - Buffer 1
					C1RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C1RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C1RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C1RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

					C1RXM1SID = MX_CAN_RXSSID(MX_CAN_RXM1_X);	// ID Mask 1 - Buffer 1
					C1RXF2SID = MX_CAN_RXSSID(MX_CAN_RXF2_X);	// ID Filter 2 - Buffer 1
					C1RXF3SID = MX_CAN_RXSSID(MX_CAN_RXF3_X);	// ID Filter 3 - Buffer 1
					C1RXF4SID = MX_CAN_RXSSID(MX_CAN_RXF4_X);	// ID Filter 4 - Buffer 1
					C1RXF5SID = MX_CAN_RXSSID(MX_CAN_RXF5_X);	// ID Filter 5 - Buffer 1

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

					C1RXM1SID = 0x0000;	// ID Mask 1 - Buffer 1
					C1RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C1RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C1RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C1RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1

				#endif

			#endif
			C1RX0CON = RXB0CTRL_VAL;
			C1RX1CON = RXB1CTRL_VAL;

			C1TX0CON = TXB0CTRL_VAL;	// Transmit Buffer 0 Control
	#if (MX_CAN_EXID_X == 1)
			C1TX0SID = MX_CAN_TXESID(MX_CAN_TXB0ID_X);
			C1TX0EID = MX_CAN_TXEEID(MX_CAN_TXB0ID_X);
			C1TX0DLC = (MX_CAN_TXEDLC(MX_CAN_TXB0ID_X)) | (MX_CAN_TXB0LEN_X << 3);
	#else
			C1TX0SID = MX_CAN_TXSSID(MX_CAN_TXB0ID_X);	//Transmit Preload S-ID
			C1TX0DLC = MX_CAN_TXB0LEN_X << 3;
	#endif
			C1TX0B1 = (MX_CAN_TXB0DB1_X << 8) | MX_CAN_TXB0DB0_X;		// Transmit Data Bytes
			C1TX0B2 = (MX_CAN_TXB0DB3_X << 8) | MX_CAN_TXB0DB2_X;
			C1TX0B3 = (MX_CAN_TXB0DB5_X << 8) | MX_CAN_TXB0DB4_X;
			C1TX0B4 = (MX_CAN_TXB0DB7_X << 8) | MX_CAN_TXB0DB6_X;

			C1TX1CON = TXB1CTRL_VAL;	// Transmit Buffer 1 Control
	#if (MX_CAN_EXID_X == 1)
			C1TX1SID = MX_CAN_TXESID(MX_CAN_TXB1ID_X);
			C1TX1EID = MX_CAN_TXEEID(MX_CAN_TXB1ID_X);
			C1TX1DLC = (MX_CAN_TXEDLC(MX_CAN_TXB1ID_X)) | (MX_CAN_TXB1LEN_X << 3);
	#else
			C1TX1SID = MX_CAN_TXSSID(MX_CAN_TXB1ID_X);	//Transmit Preload S-ID
			C1TX1DLC = MX_CAN_TXB1LEN_X << 3;
	#endif
			C1TX1B1 = (MX_CAN_TXB1DB1_X << 8) | MX_CAN_TXB1DB0_X;		// Transmit Data Bytes
			C1TX1B2 = (MX_CAN_TXB1DB3_X << 8) | MX_CAN_TXB1DB2_X;
			C1TX1B3 = (MX_CAN_TXB1DB5_X << 8) | MX_CAN_TXB1DB4_X;
			C1TX1B4 = (MX_CAN_TXB1DB7_X << 8) | MX_CAN_TXB1DB6_X;

			C1TX2CON = TXB2CTRL_VAL;	// Transmit Buffer 2 Control
	#if (MX_CAN_EXID_X == 1)
			C1TX2SID = MX_CAN_TXESID(MX_CAN_TXB2ID_X);
			C1TX2EID = MX_CAN_TXEEID(MX_CAN_TXB2ID_X);
			C1TX2DLC = (MX_CAN_TXEDLC(MX_CAN_TXB2ID_X)) | (MX_CAN_TXB2LEN_X << 3);
	#else
			C1TX2SID = MX_CAN_TXSSID(MX_CAN_TXB2ID_X);	//Transmit Preload S-ID
			C1TX2DLC = MX_CAN_TXB2LEN_X << 3;
	#endif
			C1TX2B1 = (MX_CAN_TXB2DB1_X << 8) | MX_CAN_TXB2DB0_X;		// Transmit Data Bytes
			C1TX2B2 = (MX_CAN_TXB2DB3_X << 8) | MX_CAN_TXB2DB2_X;
			C1TX2B3 = (MX_CAN_TXB2DB5_X << 8) | MX_CAN_TXB2DB4_X;
			C1TX2B4 = (MX_CAN_TXB2DB7_X << 8) | MX_CAN_TXB2DB6_X;

			// Request normal mode.
			C1CTRLbits.REQOP = REQOP_NORMAL;

			// Wait till desired mode is set.
			while( C1CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			//
			// Configure ECAN module on dsPIC33E/PIC24
			//
			//
			// Request config mode.
			C1CTRL1bits.REQOP = REQOP_CONFIG;

			// Wait till desired mode is set.
			while( C1CTRL1bits.OPMODE != REQOP_CONFIG );

			//
			// Setup DMA
			//

			// DMA0 for ECAN Xmit
			DMA0CONbits.SIZE = 0x0;
			DMA0CONbits.DIR = 0x1;
			DMA0CONbits.AMODE = 0x2;
			DMA0CONbits.MODE = 0x0;
			DMA0REQ = 70;
			DMA0CNT = 7;
			DMA0PAD = (volatile unsigned int) & C1TXD;
			#if defined (__dsPIC33E__) || defined (__PIC24E__)
				DMA0STAL = (MX_UINT32) &MX_MEMBUF_X;
				DMA0STAH = (MX_UINT32) &MX_MEMBUF_X >> 16;
			#elif defined (__dsPIC33F__) || defined (__PIC24H__)
				DMA0STA = (MX_UINT32) &MX_MEMBUF_X;
			#else
				DMA0STA = __builtin_dmaoffset(&MX_MEMBUF_X);
			#endif
			DMA0CONbits.CHEN = 0x1;

			// DMA1 for ECAN Rcv
			DMA1CONbits.SIZE = 0x0;
			DMA1CONbits.DIR = 0x0;
			DMA1CONbits.AMODE = 0x2;
			DMA1CONbits.MODE = 0x0;
			DMA1REQ = 34;
			DMA1CNT = 7;
			DMA1PAD = (volatile unsigned int) &C1RXD;
			#if defined (__dsPIC33E__) || defined (__PIC24E__)
				DMA1STAL = (MX_UINT32) &MX_MEMBUF_X;
				DMA1STAH = (MX_UINT32) &MX_MEMBUF_X >> 16;
			#elif defined (__dsPIC33F__) || defined (__PIC24H__)
				DMA0STA = (MX_UINT32) &MX_MEMBUF_X;
			#else
				DMA1STA = __builtin_dmaoffset(&MX_MEMBUF_X);
			#endif
			DMA1CONbits.CHEN = 0x1;

			// Setup channel 1:
			C1CTRL1bits.WIN=0x0;
			C1FCTRLbits.DMABS = 3;		// 12 buffers in DMA RAM
			C1FCTRLbits.FSA = 4;		// Start at buffer 4

