BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
			// No CANCKS on 33F/24H (http://www.microchip.com/forums/m421868.aspx)
			#if __dsPIC33E__ || __dsPIC24E__ || __dsPIC33F__ || __PIC24H_
				/*************************************************
				// Setup clock:
				// Set CAN clock to Fp (==Fosc/2)
				#if __dsPIC33EP256MU806__  \
					|| __dsPIC33EP256MU810__ \
					|| __dsPIC33EP256MU814__ \
					|| __PIC24EP256GU810__ \
					|| __PIC24EP256GU814__ \
					|| __dsPIC33EP512MU810__ \
					|| __dsPIC33EP512MU814__ \
					|| __dsPIC33EP512GP806__ \
					|| __dsPIC33EP512MC806__
					// (Errata: this bit is reversed)
					C1CTRL1bits.CANCKS = 1;
				#else
					C1CTRL1bits.CANCKS = 0;
				#endif

				WE NEED SOME OTHER WAY OF DOING THE ABOVE ERRATA FIX,
				DOES NOT SEEM TO APPLY IN ALL CASES.
				MAYBE AN OPTION IN THE CAN COMPONENT?
				**************************************************/
					C1CTRL1bits.CANCKS = 0;
			#endif

			// Set baudrate registers
			C1CFG1 = MX_CAN_BAUD1_X;
			C1CFG2 = MX_CAN_BAUD2_X | (MX_CAN_BAUD3_X << 8);

			/* Enable Window to Access Acceptance Filter Registers */
			C1CTRL1bits.WIN=0x1;

			//
			// Set acceptance filters
			//

			/* Select Acceptance Filter Mask 0 for Acceptance Filters 0 & 1 */
			C1FMSKSEL1bits.F0MSK=0x0;
			C1FMSKSEL1bits.F1MSK=0x0;
			/* Acceptance Filter 0 & 1 to use Message Buffer 3 to store message */
			C1BUFPNT1bits.F0BP = 0x3;
			C1BUFPNT1bits.F1BP = 0x3;
			/* Filter 0 & 1 enabled for Identifier match with incoming message */
			C1FEN1bits.FLTEN0=0x1;
			C1FEN1bits.FLTEN1=0x1;

			/* Select Acceptance Filter Mask 1 for Acceptance Filters 2,3,4,5 */
			C1FMSKSEL1bits.F2MSK=0x1;
			C1FMSKSEL1bits.F3MSK=0x1;
			C1FMSKSEL1bits.F4MSK=0x1;
			C1FMSKSEL1bits.F5MSK=0x1;
			/* Acceptance Filter 2,3,4 & 5 to use FIFO to store message */
			C1BUFPNT1bits.F2BP = 0xf;
			C1BUFPNT1bits.F3BP = 0xf;
			C1BUFPNT2bits.F4BP = 0xf;
			C1BUFPNT2bits.F5BP = 0xf;
			/* Filter 2,3,4 & 5 enabled for Identifier match with incoming message */
			C1FEN1bits.FLTEN2=0x1;
			C1FEN1bits.FLTEN3=0x1;
			C1FEN1bits.FLTEN4=0x1;
			C1FEN1bits.FLTEN5=0x1;

			#if (MX_CAN_EXID_X == 1)

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C1RXM0SIDbits.SID = 0xFFFF;
					C1RXM0SIDbits.EID = 0xFFFF;
					C1RXM0EIDbits.EID = 0xFFFF;
					C1RXF0SIDbits.SID = 0xFFFF;
					C1RXF0SIDbits.EID = 0xFFFF;
					C1RXF0EIDbits.EID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					// Configure Acceptance Filter Mask 0 register
					C1RXM0SIDbits.SID = (MX_CAN_RXM0_X >> 18) & 0x7ff;
					C1RXM0SIDbits.EID = (MX_CAN_RXM0_X >> 16) & 0x3;
					C1RXM0EIDbits.EID = (MX_CAN_RXM0_X & 0xffff);

					// Configure Acceptance Filter 0 & 1 to match extended identifier
					C1RXF0SIDbits.SID = (MX_CAN_RXF0_X >> 18) & 0x7ff;
					C1RXF0SIDbits.EID = (MX_CAN_RXF0_X >> 16) & 0x3;
					C1RXF0EIDbits.EID = (MX_CAN_RXF0_X & 0xffff);
					C1RXF1SIDbits.SID = (MX_CAN_RXF1_X >> 18) & 0x7ff;
					C1RXF1SIDbits.EID = (MX_CAN_RXF1_X >> 16) & 0x3;
					C1RXF1EIDbits.EID = (MX_CAN_RXF1_X & 0xffff);

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C1RXM0SIDbits.SID = 0x0000;
					C1RXM0SIDbits.EID = 0x0000;
					C1RXM0EIDbits.EID = 0x0000;
					C1RXF0SIDbits.SID = 0xFFFF;
					C1RXF0SIDbits.EID = 0xFFFF;
					C1RXF0EIDbits.EID = 0xFFFF;

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C1RXM1SIDbits.SID = 0xFFFF;
					C1RXM1SIDbits.EID = 0xFFFF;
					C1RXM1EIDbits.EID = 0xFFFF;
					C1RXF2SIDbits.SID = 0xFFFF;
					C1RXF2SIDbits.EID = 0xFFFF;
					C1RXF2EIDbits.EID = 0xFFFF;
					C1RXF3SIDbits.SID = 0xFFFF;
					C1RXF3SIDbits.EID = 0xFFFF;
					C1RXF3EIDbits.EID = 0xFFFF;
					C1RXF4SIDbits.SID = 0xFFFF;
					C1RXF4SIDbits.EID = 0xFFFF;
					C1RXF4EIDbits.EID = 0xFFFF;
					C1RXF5SIDbits.SID = 0xFFFF;
					C1RXF5SIDbits.EID = 0xFFFF;
					C1RXF5EIDbits.EID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

					// Configure Acceptance Filter Mask 1 register
					C1RXM1SIDbits.SID = (MX_CAN_RXM1_X >> 18) & 0x7ff;
					C1RXM1SIDbits.EID = (MX_CAN_RXM1_X >> 16) & 0x3;
					C1RXM1EIDbits.EID = (MX_CAN_RXM1_X & 0xffff);
					// Configure Acceptance Filter 2,3,4 & 5 to match extend identifier
					C1RXF2SIDbits.SID = (MX_CAN_RXF2_X >> 18) & 0x7ff;
					C1RXF2SIDbits.EID = (MX_CAN_RXF2_X >> 16) & 0x3;
					C1RXF2EIDbits.EID = (MX_CAN_RXF2_X & 0xffff);
					C1RXF3SIDbits.SID = (MX_CAN_RXF3_X >> 18) & 0x7ff;
					C1RXF3SIDbits.EID = (MX_CAN_RXF3_X >> 16) & 0x3;
					C1RXF3EIDbits.EID = (MX_CAN_RXF3_X & 0xffff);
					C1RXF4SIDbits.SID = (MX_CAN_RXF4_X >> 18) & 0x7ff;
					C1RXF4SIDbits.EID = (MX_CAN_RXF4_X >> 16) & 0x3;
					C1RXF4EIDbits.EID = (MX_CAN_RXF4_X & 0xffff);
					C1RXF5SIDbits.SID = (MX_CAN_RXF5_X >> 18) & 0x7ff;
					C1RXF5SIDbits.EID = (MX_CAN_RXF5_X >> 16) & 0x3;
					C1RXF5EIDbits.EID = (MX_CAN_RXF5_X & 0xffff);

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

					C1RXM1SIDbits.SID = 0x0000;
					C1RXM1SIDbits.EID = 0x0000;
					C1RXM1EIDbits.EID = 0x0000;
					C1RXF2SIDbits.SID = 0xFFFF;
					C1RXF2SIDbits.EID = 0xFFFF;
					C1RXF2EIDbits.EID = 0xFFFF;
					C1RXF3SIDbits.SID = 0xFFFF;
					C1RXF3SIDbits.EID = 0xFFFF;
					C1RXF3EIDbits.EID = 0xFFFF;
					C1RXF4SIDbits.SID = 0xFFFF;
					C1RXF4SIDbits.EID = 0xFFFF;
					C1RXF4EIDbits.EID = 0xFFFF;
					C1RXF5SIDbits.SID = 0xFFFF;
					C1RXF5SIDbits.EID = 0xFFFF;
					C1RXF5EIDbits.EID = 0xFFFF;

				#endif

				/* Acceptance Filter 0 & 1 to check for Extended Identifier */
				C1RXM0SIDbits.MIDE = 0x0;
				C1RXF0SIDbits.EXIDE= 0x1;
				C1RXF1SIDbits.EXIDE= 0x1;

				/* Acceptance Filter 2,3,4 & 5 to check for Extended Identifier */
				C1RXM1SIDbits.MIDE = 0x0;
				C1RXF2SIDbits.EXIDE= 0x1;
				C1RXF3SIDbits.EXIDE= 0x1;
				C1RXF4SIDbits.EXIDE= 0x1;
				C1RXF5SIDbits.EXIDE= 0x1;

			#else

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C1RXM0SIDbits.SID = 0xFFFF;
					C1RXF0SIDbits.SID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					// Configure Acceptance Filter Mask 0 register
					C1RXM0SIDbits.SID = MX_CAN_RXM0_X;
					// Configure Acceptance Filter 0 & 1 to match standard identifier
					C1RXF0SIDbits.SID = MX_CAN_RXF0_X;
					C1RXF1SIDbits.SID = MX_CAN_RXF1_X;

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C1RXM0SIDbits.SID = 0x0000;
					C1RXF0SIDbits.SID = 0xFFFF;

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C1RXM1SIDbits.SID = 0xFFFF;
					C1RXF2SIDbits.SID = 0xFFFF;
					C1RXF3SIDbits.SID = 0xFFFF;
					C1RXF4SIDbits.SID = 0xFFFF;
					C1RXF5SIDbits.SID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

