BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
					// Configure Acceptance Filter Mask 1 register
					C1RXM1SIDbits.SID = MX_CAN_RXM1_X;
					// Configure Acceptance Filter 2,3,4 & 5 to match standard identifier
					C1RXF2SIDbits.SID = MX_CAN_RXF2_X;
					C1RXF3SIDbits.SID = MX_CAN_RXF3_X;
					C1RXF4SIDbits.SID = MX_CAN_RXF4_X;
					C1RXF5SIDbits.SID = MX_CAN_RXF5_X;

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

					C1RXM1SIDbits.SID = 0x0000;
					C1RXF2SIDbits.SID = 0xFFFF;
					C1RXF3SIDbits.SID = 0xFFFF;
					C1RXF4SIDbits.SID = 0xFFFF;
					C1RXF5SIDbits.SID = 0xFFFF;

				#endif

				/* Acceptance Filter 0 & 1 to check for Standard Identifier */
				C1RXM0SIDbits.MIDE = 0x1;
				C1RXF0SIDbits.EXIDE= 0x0;
				C1RXF1SIDbits.EXIDE= 0x0;

				/* Acceptance Filter 2,3,4 & 5 to check for Standard Identifier */
				C1RXM1SIDbits.MIDE = 0x1;
				C1RXF2SIDbits.EXIDE= 0x0;
				C1RXF3SIDbits.EXIDE= 0x0;
				C1RXF4SIDbits.EXIDE= 0x0;
				C1RXF5SIDbits.EXIDE= 0x0;
			#endif

			/* Clear Window Bit to Access ECAN Control Registers */
			C1CTRL1bits.WIN=0x0;

			//
			// Preload transmit buffers
			//
			/* Configure Message Buffer 0 for Transmission and assign priority*/
			C1TR01CONbits.TXEN0 = 0x1;
			C1TR01CONbits.TX0PRI = 0x3;

			#if (MX_CAN_EXID_X == 1)
				MX_MEMBUF_X[0][0] = ((MX_CAN_TXB0ID_X >> 16) & 0b0001111111111100) | 0x01;
				MX_MEMBUF_X[0][1] = ((MX_CAN_TXB0ID_X >> 6 ) & 0b0000111111111111);
				MX_MEMBUF_X[0][2] = ((MX_CAN_TXB0ID_X & 0b111111) << 10) | (MX_CAN_TXB0LEN_X & 0xf);
			#else
				MX_MEMBUF_X[0][0] = (MX_CAN_TXB0ID_X << 2) & 0b0001111111111100;
				MX_MEMBUF_X[0][1] = 0x0000;
				MX_MEMBUF_X[0][2] = MX_CAN_TXB0LEN_X & 0xf;
			#endif
			MX_MEMBUF_X[0][3] = (MX_CAN_TXB0DB1_X << 8) | MX_CAN_TXB0DB0_X;		// Transmit Data Bytes
			MX_MEMBUF_X[0][4] = (MX_CAN_TXB0DB3_X << 8) | MX_CAN_TXB0DB2_X;
			MX_MEMBUF_X[0][5] = (MX_CAN_TXB0DB5_X << 8) | MX_CAN_TXB0DB4_X;
			MX_MEMBUF_X[0][6] = (MX_CAN_TXB0DB7_X << 8) | MX_CAN_TXB0DB6_X;

			/* Configure Message Buffer 1 for Transmission and assign priority*/
			C1TR01CONbits.TXEN1 = 0x1;
			C1TR01CONbits.TX1PRI = 0x3;

			#if (MX_CAN_EXID_X == 1)
				MX_MEMBUF_X[1][0] = ((MX_CAN_TXB1ID_X >> 16) & 0b0001111111111100) | 0x01;
				MX_MEMBUF_X[1][1] = ((MX_CAN_TXB1ID_X >> 6 ) & 0b0000111111111111);
				MX_MEMBUF_X[1][2] = ((MX_CAN_TXB1ID_X & 0b111111) << 10) | (MX_CAN_TXB1LEN_X & 0xf);
			#else
				MX_MEMBUF_X[1][0] = (MX_CAN_TXB1ID_X << 2) & 0b0001111111111100;
				MX_MEMBUF_X[1][1] = 0x0000;
				MX_MEMBUF_X[1][2] = MX_CAN_TXB1LEN_X & 0xf;
			#endif
			MX_MEMBUF_X[1][3] = (MX_CAN_TXB1DB1_X << 8) | MX_CAN_TXB1DB0_X;		// Transmit Data Bytes
			MX_MEMBUF_X[1][4] = (MX_CAN_TXB1DB3_X << 8) | MX_CAN_TXB1DB2_X;
			MX_MEMBUF_X[1][5] = (MX_CAN_TXB1DB5_X << 8) | MX_CAN_TXB1DB4_X;
			MX_MEMBUF_X[1][6] = (MX_CAN_TXB1DB7_X << 8) | MX_CAN_TXB1DB6_X;

			/* Configure Message Buffer 3 for Transmission and assign priority*/
			C1TR23CONbits.TXEN2 = 0x1;
			C1TR23CONbits.TX2PRI = 0x3;

			#if (MX_CAN_EXID_X == 1)
				MX_MEMBUF_X[2][0] = ((MX_CAN_TXB2ID_X >> 16) & 0b0001111111111100) | 0x01;
				MX_MEMBUF_X[2][1] = ((MX_CAN_TXB2ID_X >> 6 ) & 0b0000111111111111);
				MX_MEMBUF_X[2][2] = ((MX_CAN_TXB2ID_X & 0b111111) << 10) | (MX_CAN_TXB2LEN_X & 0xf);
			#else
				MX_MEMBUF_X[2][0] = (MX_CAN_TXB2ID_X << 2) & 0b0001111111111100;
				MX_MEMBUF_X[2][1] = 0x0000;
				MX_MEMBUF_X[2][2] = MX_CAN_TXB2LEN_X & 0xf;
			#endif
			MX_MEMBUF_X[2][3] = (MX_CAN_TXB2DB1_X << 8) | MX_CAN_TXB2DB0_X;		// Transmit Data Bytes
			MX_MEMBUF_X[2][4] = (MX_CAN_TXB2DB3_X << 8) | MX_CAN_TXB2DB2_X;
			MX_MEMBUF_X[2][5] = (MX_CAN_TXB2DB5_X << 8) | MX_CAN_TXB2DB4_X;
			MX_MEMBUF_X[2][6] = (MX_CAN_TXB2DB7_X << 8) | MX_CAN_TXB2DB6_X;

			//
			// Switch to Normal Mode Operating Mode
			//
			C1CTRL1bits.REQOP = 0;
			while(C1CTRL1bits.OPMODE != 0);
		#endif

	#endif

	#if (MX_CAN_CHANNEL_X == 2)

		// Remap pins
		#ifdef MX_CAN_2_REMAPPABLE
			MX_CAN_2_TX_RPOR = MX_CAN_2_TX_RPNUM;
			MX_CAN_2_RX_RPINR = MX_CAN_2_RX_RP;
		#endif

		#ifdef __dsPIC30F__	// dsPIC30F Device
			//configure CAN I/O - ds30F??

			C2CTRL = C2CTRL_VAL;

			// Request config mode.
			C2CTRLbits.REQOP = REQOP_CONFIG;

			// Wait till desired mode is set.
			while( C2CTRLbits.OPMODE != REQOP_CONFIG );

			// Now set the baud rate.
			C2CFG2 = MX_CAN_BAUD2_X | (MX_CAN_BAUD3_X << 8);
			C2CFG1 = MX_CAN_BAUD1_X;

			//Setup the CAN comms Masks and Filters
			#if (MX_CAN_EXID_X == 1)

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C2RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C2RXF0EIDL = 0xFFFF;
					C2RXF0EIDH = 0xFFFF;
					C2RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0
					C2RXF1EIDL = 0xFFFF;
					C2RXF1EIDH = 0xFFFF;
					C2RXM0SID = 0xFFFF;	// ID Mask 0 - Buffer 0
					C2RXM0EIDL = 0xFFFF;
					C2RXM0EIDH = 0xFFFF;

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					C2RXF0SID = MX_CAN_RXESID(MX_CAN_RXF0_X);	// ID Filter 0 - Buffer 0
					C2RXF0EIDL = MX_CAN_RXEIDL(MX_CAN_RXF0_X);
					C2RXF0EIDH = MX_CAN_RXEIDH(MX_CAN_RXF0_X);
					C2RXF1SID = MX_CAN_RXESID(MX_CAN_RXF1_X);	// ID Filter 1 - Buffer 0
					C2RXF1EIDL = MX_CAN_RXEIDL(MX_CAN_RXF1_X);
					C2RXF1EIDH = MX_CAN_RXEIDH(MX_CAN_RXF1_X);
					C2RXM0SID = MX_CAN_RXESID(MX_CAN_RXM0_X);	// ID Mask 0 - Buffer 0
					C2RXM0EIDL = MX_CAN_RXEIDL(MX_CAN_RXM0_X);
					C2RXM0EIDH = MX_CAN_RXEIDH(MX_CAN_RXM0_X);

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C2RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C2RXF0EIDL = 0xFFFF;
					C2RXF0EIDH = 0xFFFF;
					C2RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0
					C2RXF1EIDL = 0xFFFF;
					C2RXF1EIDH = 0xFFFF;
					C2RXM0SID = 0x0000;	// ID Mask 0 - Buffer 0
					C2RXM0EIDL = 0x0000;
					C2RXM0EIDH = 0x0000;

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C2RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C2RXF2EIDL = 0xFFFF;
					C2RXF2EIDH = 0xFFFF;
					C2RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C2RXF3EIDL = 0xFFFF;
					C2RXF3EIDH = 0xFFFF;
					C2RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C2RXF4EIDL = 0xFFFF;
					C2RXF4EIDH = 0xFFFF;
					C2RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1
					C2RXF5EIDL = 0xFFFF;
					C2RXF5EIDH = 0xFFFF;
					C2RXM1SID = 0xFFFF;	// ID Mask 1 - Buffer 1
					C2RXM1EIDL = 0xFFFF;
					C2RXM1EIDH = 0xFFFF;

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

					C2RXF2SID = MX_CAN_RXESID(MX_CAN_RXF2_X);	// ID Filter 2 - Buffer 1
					C2RXF2EIDL = MX_CAN_RXEIDL(MX_CAN_RXF2_X);
					C2RXF2EIDH = MX_CAN_RXEIDH(MX_CAN_RXF2_X);
					C2RXF3SID = MX_CAN_RXESID(MX_CAN_RXF3_X);	// ID Filter 3 - Buffer 1
					C2RXF3EIDL = MX_CAN_RXEIDL(MX_CAN_RXF3_X);
					C2RXF3EIDH = MX_CAN_RXEIDH(MX_CAN_RXF3_X);
					C2RXF4SID = MX_CAN_RXESID(MX_CAN_RXF4_X);	// ID Filter 4 - Buffer 1
					C2RXF4EIDL = MX_CAN_RXEIDL(MX_CAN_RXF4_X);
					C2RXF4EIDH = MX_CAN_RXEIDH(MX_CAN_RXF4_X);
					C2RXF5SID = MX_CAN_RXESID(MX_CAN_RXF5_X);	// ID Filter 5 - Buffer 1
					C2RXF5EIDL = MX_CAN_RXEIDL(MX_CAN_RXF5_X);
					C2RXF5EIDH = MX_CAN_RXEIDH(MX_CAN_RXF5_X);
					C2RXM1SID = MX_CAN_RXESID(MX_CAN_RXM1_X);	// ID Mask 1 - Buffer 1
					C2RXM1EIDL = MX_CAN_RXEIDL(MX_CAN_RXM1_X);
					C2RXM1EIDH = MX_CAN_RXEIDH(MX_CAN_RXM1_X);

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

