BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
					C2RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C2RXF2EIDL = 0xFFFF;
					C2RXF2EIDH = 0xFFFF;
					C2RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C2RXF3EIDL = 0xFFFF;
					C2RXF3EIDH = 0xFFFF;
					C2RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C2RXF4EIDL = 0xFFFF;
					C2RXF4EIDH = 0xFFFF;
					C2RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1
					C2RXF5EIDL = 0xFFFF;
					C2RXF5EIDH = 0xFFFF;
					C2RXM1SID = 0x0000;	// ID Mask 1 - Buffer 1
					C2RXM1EIDL = 0x0000;
					C2RXM1EIDH = 0x0000;

				#endif

			#else

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C2RXM0SID = 0xFFFF;	// ID Mask 0 - Buffer 0
					C2RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C2RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					C2RXM0SID = MX_CAN_RXSSID(MX_CAN_RXM0_X);	// ID Mask 0 - Buffer 0
					C2RXF0SID = MX_CAN_RXSSID(MX_CAN_RXF0_X);	// ID Filter 0 - Buffer 0
					C2RXF1SID = MX_CAN_RXSSID(MX_CAN_RXF1_X);	// ID Filter 1 - Buffer 0

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C2RXM0SID = 0x0000;	// ID Mask 0 - Buffer 0
					C2RXF0SID = 0xFFFF;	// ID Filter 0 - Buffer 0
					C2RXF1SID = 0xFFFF;	// ID Filter 1 - Buffer 0

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C2RXM1SID = 0xFFFF;	// ID Mask 1 - Buffer 1
					C2RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C2RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C2RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C2RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

					C2RXM1SID = MX_CAN_RXSSID(MX_CAN_RXM1_X);	// ID Mask 1 - Buffer 1
					C2RXF2SID = MX_CAN_RXSSID(MX_CAN_RXF2_X);	// ID Filter 2 - Buffer 1
					C2RXF3SID = MX_CAN_RXSSID(MX_CAN_RXF3_X);	// ID Filter 3 - Buffer 1
					C2RXF4SID = MX_CAN_RXSSID(MX_CAN_RXF4_X);	// ID Filter 4 - Buffer 1
					C2RXF5SID = MX_CAN_RXSSID(MX_CAN_RXF5_X);	// ID Filter 5 - Buffer 1

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

					C2RXM1SID = 0x0000;	// ID Mask 1 - Buffer 1
					C2RXF2SID = 0xFFFF;	// ID Filter 2 - Buffer 1
					C2RXF3SID = 0xFFFF;	// ID Filter 3 - Buffer 1
					C2RXF4SID = 0xFFFF;	// ID Filter 4 - Buffer 1
					C2RXF5SID = 0xFFFF;	// ID Filter 5 - Buffer 1

				#endif

			#endif
			C2RX0CON = RXB0CTRL_VAL;
			C2RX1CON = RXB1CTRL_VAL;

			C2TX0CON = TXB0CTRL_VAL;	// Transmit Buffer 0 Control
	#if (MX_CAN_EXID_X == 1)
			C2TX0SID = MX_CAN_TXESID(MX_CAN_TXB0ID_X);
			C2TX0EID = MX_CAN_TXEEID(MX_CAN_TXB0ID_X);
			C2TX0DLC = (MX_CAN_TXEDLC(MX_CAN_TXB0ID_X)) | (MX_CAN_TXB0LEN_X << 3);
	#else
			C2TX0SID = MX_CAN_TXSSID(MX_CAN_TXB0ID_X);	//Transmit Preload S-ID
			C2TX0DLC = MX_CAN_TXB0LEN_X << 3;
	#endif
			C2TX0B1 = (MX_CAN_TXB0DB1_X << 8) | MX_CAN_TXB0DB0_X;		// Transmit Data Bytes
			C2TX0B2 = (MX_CAN_TXB0DB3_X << 8) | MX_CAN_TXB0DB2_X;
			C2TX0B3 = (MX_CAN_TXB0DB5_X << 8) | MX_CAN_TXB0DB4_X;
			C2TX0B4 = (MX_CAN_TXB0DB7_X << 8) | MX_CAN_TXB0DB6_X;

			C2TX1CON = TXB1CTRL_VAL;	// Transmit Buffer 1 Control
	#if (MX_CAN_EXID_X == 1)
			C2TX1SID = MX_CAN_TXESID(MX_CAN_TXB1ID_X);
			C2TX1EID = MX_CAN_TXEEID(MX_CAN_TXB1ID_X);
			C2TX1DLC = (MX_CAN_TXEDLC(MX_CAN_TXB1ID_X)) | (MX_CAN_TXB1LEN_X << 3);
	#else
			C2TX1SID = MX_CAN_TXSSID(MX_CAN_TXB1ID_X);	//Transmit Preload S-ID
			C2TX1DLC = MX_CAN_TXB1LEN_X << 3;
	#endif
			C2TX1B1 = (MX_CAN_TXB1DB1_X << 8) | MX_CAN_TXB1DB0_X;		// Transmit Data Bytes
			C2TX1B2 = (MX_CAN_TXB1DB3_X << 8) | MX_CAN_TXB1DB2_X;
			C2TX1B3 = (MX_CAN_TXB1DB5_X << 8) | MX_CAN_TXB1DB4_X;
			C2TX1B4 = (MX_CAN_TXB1DB7_X << 8) | MX_CAN_TXB1DB6_X;

			C2TX2CON = TXB2CTRL_VAL;	// Transmit Buffer 2 Control
	#if (MX_CAN_EXID_X == 1)
			C2TX2SID = MX_CAN_TXESID(MX_CAN_TXB2ID_X);
			C2TX2EID = MX_CAN_TXEEID(MX_CAN_TXB2ID_X);
			C2TX2DLC = (MX_CAN_TXEDLC(MX_CAN_TXB2ID_X)) | (MX_CAN_TXB2LEN_X << 3);
	#else
			C2TX2SID = MX_CAN_TXSSID(MX_CAN_TXB2ID_X);	//Transmit Preload S-ID
			C2TX2DLC = MX_CAN_TXB2LEN_X << 3;
	#endif
			C2TX2B1 = (MX_CAN_TXB2DB1_X << 8) | MX_CAN_TXB2DB0_X;		// Transmit Data Bytes
			C2TX2B2 = (MX_CAN_TXB2DB3_X << 8) | MX_CAN_TXB2DB2_X;
			C2TX2B3 = (MX_CAN_TXB2DB5_X << 8) | MX_CAN_TXB2DB4_X;
			C2TX2B4 = (MX_CAN_TXB2DB7_X << 8) | MX_CAN_TXB2DB6_X;

			// Request normal mode.
			C2CTRLbits.REQOP = REQOP_NORMAL;

			// Wait till desired mode is set.
			while( C2CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			//
			// Configure ECAN module on dsPIC33E/PIC24
			//
			//
			// Request config mode.
			C2CTRL1bits.REQOP = REQOP_CONFIG;

			// Wait till desired mode is set.
			while( C2CTRL1bits.OPMODE != REQOP_CONFIG );

			//
			// Setup DMA
			//

			// DMA2 for ECAN Xmit
			DMA2CONbits.SIZE = 0x0;
			DMA2CONbits.DIR = 0x1;
			DMA2CONbits.AMODE = 0x2;
			DMA2CONbits.MODE = 0x0;
			DMA2REQ = 71;
			DMA2CNT = 7;
			DMA2PAD = (volatile unsigned int) & C2TXD;
			#if defined (__dsPIC33E__) || defined (__PIC24E__) || defined (__dsPIC33F__)
				DMA2STAL = (MX_UINT32) &MX_MEMBUF_X;
				DMA2STAH = (MX_UINT32) &MX_MEMBUF_X >> 16;
			#else
				DMA2STA = __builtin_dmaoffset(&MX_MEMBUF_X);
			#endif
			DMA2CONbits.CHEN = 0x1;

			// DMA3 for ECAN Rcv
			DMA3CONbits.SIZE = 0x0;
			DMA3CONbits.DIR = 0x0;
			DMA3CONbits.AMODE = 0x2;
			DMA3CONbits.MODE = 0x0;
			DMA3REQ = 55;
			DMA3CNT = 7;
			DMA3PAD = (volatile unsigned int) &C2RXD;
			#if defined (__dsPIC33E__) || defined (__PIC24E__) || defined (__dsPIC33F__)
				DMA3STAL = (MX_UINT32) &MX_MEMBUF_X;
				DMA3STAH = (MX_UINT32) &MX_MEMBUF_X >> 16;
			#else
				DMA3STA = __builtin_dmaoffset(&MX_MEMBUF_X);
			#endif
			DMA3CONbits.CHEN = 0x1;

			// Setup channel 1:
			C2CTRL1bits.WIN=0x0;
			C2FCTRLbits.DMABS = 3;		// 12 buffers in DMA RAM
			C2FCTRLbits.FSA = 4;		// Start at buffer 4

			// No CANCKS on 33F/24H (http://www.microchip.com/forums/m421868.aspx)
			#if __dsPIC33E__ || __dsPIC24E__ || __dsPIC33F__ || _PIC24H_
				/*************************************************
				// Setup clock:
				// Set CAN clock to Fp (==Fosc/2)
				#if __dsPIC33EP256MU806__  \
					|| __dsPIC33EP256MU810__ \
					|| __dsPIC33EP256MU814__ \
					|| __PIC24EP256GU810__ \
					|| __PIC24EP256GU814__ \
					|| __dsPIC33EP512MU810__ \
					|| __dsPIC33EP512MU814__ \
					|| __dsPIC33EP512GP806__ \
					|| __dsPIC33EP512MC806__
					// (Errata: this bit is reversed)
					C2CTRL1bits.CANCKS = 1;
				#else
					C2CTRL1bits.CANCKS = 0;
				#endif

				WE NEED SOME OTHER WAY OF DOING THE ABOVE ERRATA FIX,
				DOES NOT SEEM TO APPLY IN ALL CASES.
				MAYBE AN OPTION IN THE CAN COMPONENT?
				**************************************************/
					C2CTRL1bits.CANCKS = 0;
			#endif

			// Set baudrate registers
			C2CFG1 = MX_CAN_BAUD1_X;
			C2CFG2 = MX_CAN_BAUD2_X | (MX_CAN_BAUD3_X << 8);

