BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
			/* Enable Window to Access Acceptance Filter Registers */
			C2CTRL1bits.WIN=0x1;

			//
			// Set acceptance filters
			//

			/* Select Acceptance Filter Mask 0 for Acceptance Filters 0 & 1 */
			C2FMSKSEL1bits.F0MSK=0x0;
			C2FMSKSEL1bits.F1MSK=0x0;
			/* Acceptance Filter 0 & 1 to use Message Buffer 3 to store message */
			C2BUFPNT1bits.F0BP = 0x3;
			C2BUFPNT1bits.F1BP = 0x3;
			/* Filter 0 & 1 enabled for Identifier match with incoming message */
			C2FEN1bits.FLTEN0=0x1;
			C2FEN1bits.FLTEN1=0x1;

			/* Select Acceptance Filter Mask 1 for Acceptance Filters 2,3,4,5 */
			C2FMSKSEL1bits.F2MSK=0x1;
			C2FMSKSEL1bits.F3MSK=0x1;
			C2FMSKSEL1bits.F4MSK=0x1;
			C2FMSKSEL1bits.F5MSK=0x1;
			/* Acceptance Filter 2,3,4 & 5 to use FIFO to store message */
			C2BUFPNT1bits.F2BP = 0xf;
			C2BUFPNT1bits.F3BP = 0xf;
			C2BUFPNT2bits.F4BP = 0xf;
			C2BUFPNT2bits.F5BP = 0xf;
			/* Filter 2,3,4 & 5 enabled for Identifier match with incoming message */
			C2FEN1bits.FLTEN2=0x1;
			C2FEN1bits.FLTEN3=0x1;
			C2FEN1bits.FLTEN4=0x1;
			C2FEN1bits.FLTEN5=0x1;

			#if (MX_CAN_EXID_X == 1)

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C2RXM0SIDbits.SID = 0xFFFF;
					C2RXM0SIDbits.EID = 0xFFFF;
					C2RXM0EIDbits.EID = 0xFFFF;
					C2RXF0SIDbits.SID = 0xFFFF;
					C2RXF0SIDbits.EID = 0xFFFF;
					C2RXF0EIDbits.EID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					// Configure Acceptance Filter Mask 0 register
					C2RXM0SIDbits.SID = (MX_CAN_RXM0_X >> 18) & 0x7ff;
					C2RXM0SIDbits.EID = (MX_CAN_RXM0_X >> 16) & 0x3;
					C2RXM0EIDbits.EID = (MX_CAN_RXM0_X & 0xffff);

					// Configure Acceptance Filter 0 & 1 to match extended identifier
					C2RXF0SIDbits.SID = (MX_CAN_RXF0_X >> 18) & 0x7ff;
					C2RXF0SIDbits.EID = (MX_CAN_RXF0_X >> 16) & 0x3;
					C2RXF0EIDbits.EID = (MX_CAN_RXF0_X & 0xffff);
					C2RXF1SIDbits.SID = (MX_CAN_RXF1_X >> 18) & 0x7ff;
					C2RXF1SIDbits.EID = (MX_CAN_RXF1_X >> 16) & 0x3;
					C2RXF1EIDbits.EID = (MX_CAN_RXF1_X & 0xffff);

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C2RXM1SIDbits.SID = 0x0000;
					C2RXM1SIDbits.EID = 0x0000;
					C2RXM1EIDbits.EID = 0x0000;
					C2RXF2SIDbits.SID = 0xFFFF;
					C2RXF2SIDbits.EID = 0xFFFF;
					C2RXF2EIDbits.EID = 0xFFFF;
					C2RXF3SIDbits.SID = 0xFFFF;
					C2RXF3SIDbits.EID = 0xFFFF;
					C2RXF3EIDbits.EID = 0xFFFF;
					C2RXF4SIDbits.SID = 0xFFFF;
					C2RXF4SIDbits.EID = 0xFFFF;
					C2RXF4EIDbits.EID = 0xFFFF;
					C2RXF5SIDbits.SID = 0xFFFF;
					C2RXF5SIDbits.EID = 0xFFFF;
					C2RXF5EIDbits.EID = 0xFFFF;

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C2RXM1SIDbits.SID = 0xFFFF;
					C2RXM1SIDbits.EID = 0xFFFF;
					C2RXM1EIDbits.EID = 0xFFFF;
					C2RXF2SIDbits.SID = 0xFFFF;
					C2RXF2SIDbits.EID = 0xFFFF;
					C2RXF2EIDbits.EID = 0xFFFF;
					C2RXF3SIDbits.SID = 0xFFFF;
					C2RXF3SIDbits.EID = 0xFFFF;
					C2RXF3EIDbits.EID = 0xFFFF;
					C2RXF4SIDbits.SID = 0xFFFF;
					C2RXF4SIDbits.EID = 0xFFFF;
					C2RXF4EIDbits.EID = 0xFFFF;
					C2RXF5SIDbits.SID = 0xFFFF;
					C2RXF5SIDbits.EID = 0xFFFF;
					C2RXF5EIDbits.EID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

					// Configure Acceptance Filter Mask 1 register
					C2RXM1SIDbits.SID = (MX_CAN_RXM1_X >> 18) & 0x7ff;
					C2RXM1SIDbits.EID = (MX_CAN_RXM1_X >> 16) & 0x3;
					C2RXM1EIDbits.EID = (MX_CAN_RXM1_X & 0xffff);
					// Configure Acceptance Filter 2,3,4 & 5 to match extend identifier
					C2RXF2SIDbits.SID = (MX_CAN_RXF2_X >> 18) & 0x7ff;
					C2RXF2SIDbits.EID = (MX_CAN_RXF2_X >> 16) & 0x3;
					C2RXF2EIDbits.EID = (MX_CAN_RXF2_X & 0xffff);
					C2RXF3SIDbits.SID = (MX_CAN_RXF3_X >> 18) & 0x7ff;
					C2RXF3SIDbits.EID = (MX_CAN_RXF3_X >> 16) & 0x3;
					C2RXF3EIDbits.EID = (MX_CAN_RXF3_X & 0xffff);
					C2RXF4SIDbits.SID = (MX_CAN_RXF4_X >> 18) & 0x7ff;
					C2RXF4SIDbits.EID = (MX_CAN_RXF4_X >> 16) & 0x3;
					C2RXF4EIDbits.EID = (MX_CAN_RXF4_X & 0xffff);
					C2RXF5SIDbits.SID = (MX_CAN_RXF5_X >> 18) & 0x7ff;
					C2RXF5SIDbits.EID = (MX_CAN_RXF5_X >> 16) & 0x3;
					C2RXF5EIDbits.EID = (MX_CAN_RXF5_X & 0xffff);

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

					C2RXM1SIDbits.SID = 0x0000;
					C2RXM1SIDbits.EID = 0x0000;
					C2RXM1EIDbits.EID = 0x0000;
					C2RXF2SIDbits.SID = 0xFFFF;
					C2RXF2SIDbits.EID = 0xFFFF;
					C2RXF2EIDbits.EID = 0xFFFF;
					C2RXF3SIDbits.SID = 0xFFFF;
					C2RXF3SIDbits.EID = 0xFFFF;
					C2RXF3EIDbits.EID = 0xFFFF;
					C2RXF4SIDbits.SID = 0xFFFF;
					C2RXF4SIDbits.EID = 0xFFFF;
					C2RXF4EIDbits.EID = 0xFFFF;
					C2RXF5SIDbits.SID = 0xFFFF;
					C2RXF5SIDbits.EID = 0xFFFF;
					C2RXF5EIDbits.EID = 0xFFFF;

				#endif

				/* Acceptance Filter 0 & 1 to check for Extended Identifier */
				C2RXM0SIDbits.MIDE = 0x0;
				C2RXF0SIDbits.EXIDE= 0x1;
				C2RXF1SIDbits.EXIDE= 0x1;

				/* Acceptance Filter 2,3,4 & 5 to check for Extended Identifier */
				C2RXM1SIDbits.MIDE = 0x0;
				C2RXF2SIDbits.EXIDE= 0x1;
				C2RXF3SIDbits.EXIDE= 0x1;
				C2RXF4SIDbits.EXIDE= 0x1;
				C2RXF5SIDbits.EXIDE= 0x1;

			#else

				#if (MX_CAN_RXB0CFG_X == 0)		//Reject All

					C2RXM0SIDbits.SID = 0xFFFF;
					C2RXF0SIDbits.SID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB0CFG_X == 1)		//Use Mask and Filter

					// Configure Acceptance Filter Mask 0 register
					C2RXM0SIDbits.SID = MX_CAN_RXM0_X;
					// Configure Acceptance Filter 0 & 1 to match standard identifier
					C2RXF0SIDbits.SID = MX_CAN_RXF0_X;
					C2RXF1SIDbits.SID = MX_CAN_RXF1_X;

				#endif

				#if (MX_CAN_RXB0CFG_X == 2)		//Accept All

					C2RXM0SIDbits.SID = 0x0000;
					C2RXF0SIDbits.SID = 0xFFFF;

				#endif


				#if (MX_CAN_RXB1CFG_X == 0)		//Reject All

					C2RXM1SIDbits.SID = 0xFFFF;
					C2RXF2SIDbits.SID = 0xFFFF;
					C2RXF3SIDbits.SID = 0xFFFF;
					C2RXF4SIDbits.SID = 0xFFFF;
					C2RXF5SIDbits.SID = 0xFFFF;

				#endif

				#if (MX_CAN_RXB1CFG_X == 1)		//Use Mask and Filter

					// Configure Acceptance Filter Mask 1 register
					C2RXM1SIDbits.SID = MX_CAN_RXM1_X;
					// Configure Acceptance Filter 2,3,4 & 5 to match standard identifier
					C2RXF2SIDbits.SID = MX_CAN_RXF2_X;
					C2RXF3SIDbits.SID = MX_CAN_RXF3_X;
					C2RXF4SIDbits.SID = MX_CAN_RXF4_X;
					C2RXF5SIDbits.SID = MX_CAN_RXF5_X;

				#endif

				#if (MX_CAN_RXB1CFG_X == 2)		//Accept All

					C2RXM1SIDbits.SID = 0x0000;
					C2RXF2SIDbits.SID = 0xFFFF;
					C2RXF3SIDbits.SID = 0xFFFF;
					C2RXF4SIDbits.SID = 0xFFFF;
					C2RXF5SIDbits.SID = 0xFFFF;

				#endif

				/* Acceptance Filter 0 & 1 to check for Standard Identifier */
				C2RXM0SIDbits.MIDE = 0x1;
				C2RXF0SIDbits.EXIDE= 0x0;
				C2RXF1SIDbits.EXIDE= 0x0;

