BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
				/* Acceptance Filter 2,3,4 & 5 to check for Standard Identifier */
				C2RXM1SIDbits.MIDE = 0x1;
				C2RXF2SIDbits.EXIDE= 0x0;
				C2RXF3SIDbits.EXIDE= 0x0;
				C2RXF4SIDbits.EXIDE= 0x0;
				C2RXF5SIDbits.EXIDE= 0x0;
			#endif

			/* Clear Window Bit to Access ECAN Control Registers */
			C2CTRL1bits.WIN=0x0;

			//
			// Preload transmit buffers
			//
			/* Configure Message Buffer 0 for Transmission and assign priority*/
			C2TR01CONbits.TXEN0 = 0x1;
			C2TR01CONbits.TX0PRI = 0x3;

			#if (MX_CAN_EXID_X == 1)
				MX_MEMBUF_X[0][0] = ((MX_CAN_TXB0ID_X >> 16) & 0b0001111111111100) | 0x01;
				MX_MEMBUF_X[0][1] = ((MX_CAN_TXB0ID_X >> 6 ) & 0b0000111111111111);
				MX_MEMBUF_X[0][2] = ((MX_CAN_TXB0ID_X & 0b111111) << 10) | (MX_CAN_TXB0LEN_X & 0xf);
			#else
				MX_MEMBUF_X[0][0] = (MX_CAN_TXB0ID_X << 2) & 0b0001111111111100;
				MX_MEMBUF_X[0][1] = 0x0000;
				MX_MEMBUF_X[0][2] = MX_CAN_TXB0LEN_X & 0xf;
			#endif
			MX_MEMBUF_X[0][3] = (MX_CAN_TXB0DB1_X << 8) | MX_CAN_TXB0DB0_X;		// Transmit Data Bytes
			MX_MEMBUF_X[0][4] = (MX_CAN_TXB0DB3_X << 8) | MX_CAN_TXB0DB2_X;
			MX_MEMBUF_X[0][5] = (MX_CAN_TXB0DB5_X << 8) | MX_CAN_TXB0DB4_X;
			MX_MEMBUF_X[0][6] = (MX_CAN_TXB0DB7_X << 8) | MX_CAN_TXB0DB6_X;

			/* Configure Message Buffer 1 for Transmission and assign priority*/
			C2TR01CONbits.TXEN1 = 0x1;
			C2TR01CONbits.TX1PRI = 0x3;

			#if (MX_CAN_EXID_X == 1)
				MX_MEMBUF_X[1][0] = ((MX_CAN_TXB1ID_X >> 16) & 0b0001111111111100) | 0x01;
				MX_MEMBUF_X[1][1] = ((MX_CAN_TXB1ID_X >> 6 ) & 0b0000111111111111);
				MX_MEMBUF_X[1][2] = ((MX_CAN_TXB1ID_X & 0b111111) << 10) | (MX_CAN_TXB1LEN_X & 0xf);
			#else
				MX_MEMBUF_X[1][0] = (MX_CAN_TXB1ID_X << 2) & 0b0001111111111100;
				MX_MEMBUF_X[1][1] = 0x0000;
				MX_MEMBUF_X[1][2] = MX_CAN_TXB1LEN_X & 0xf;
			#endif
			MX_MEMBUF_X[1][3] = (MX_CAN_TXB1DB1_X << 8) | MX_CAN_TXB1DB0_X;		// Transmit Data Bytes
			MX_MEMBUF_X[1][4] = (MX_CAN_TXB1DB3_X << 8) | MX_CAN_TXB1DB2_X;
			MX_MEMBUF_X[1][5] = (MX_CAN_TXB1DB5_X << 8) | MX_CAN_TXB1DB4_X;
			MX_MEMBUF_X[1][6] = (MX_CAN_TXB1DB7_X << 8) | MX_CAN_TXB1DB6_X;

			/* Configure Message Buffer 3 for Transmission and assign priority*/
			C2TR23CONbits.TXEN2 = 0x1;
			C2TR23CONbits.TX2PRI = 0x3;

			#if (MX_CAN_EXID_X == 1)
				MX_MEMBUF_X[2][0] = ((MX_CAN_TXB2ID_X >> 16) & 0b0001111111111100) | 0x01;
				MX_MEMBUF_X[2][1] = ((MX_CAN_TXB2ID_X >> 6 ) & 0b0000111111111111);
				MX_MEMBUF_X[2][2] = ((MX_CAN_TXB2ID_X & 0b111111) << 10) | (MX_CAN_TXB2LEN_X & 0xf);
			#else
				MX_MEMBUF_X[2][0] = (MX_CAN_TXB2ID_X << 2) & 0b0001111111111100;
				MX_MEMBUF_X[2][1] = 0x0000;
				MX_MEMBUF_X[2][2] = MX_CAN_TXB2LEN_X & 0xf;
			#endif
			MX_MEMBUF_X[2][3] = (MX_CAN_TXB2DB1_X << 8) | MX_CAN_TXB2DB0_X;		// Transmit Data Bytes
			MX_MEMBUF_X[2][4] = (MX_CAN_TXB2DB3_X << 8) | MX_CAN_TXB2DB2_X;
			MX_MEMBUF_X[2][5] = (MX_CAN_TXB2DB5_X << 8) | MX_CAN_TXB2DB4_X;
			MX_MEMBUF_X[2][6] = (MX_CAN_TXB2DB7_X << 8) | MX_CAN_TXB2DB6_X;

			//
			// Switch to Normal Mode Operating Mode
			//
			C2CTRL1bits.REQOP = 0;
			while(C2CTRL1bits.OPMODE != 0);
		#endif


   	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_Uninit_, (void))
{
	#ifdef __dsPIC30F__
		#if (MX_CAN_CHANNEL_X == 1)
			C1CTRL = 0x00;
		#endif

		#if (MX_CAN_CHANNEL_X == 2)
			C2CTRL = 0x00;
		#endif
	#else
		#if (MX_CAN_CHANNEL_X == 1)
			C1CTRL1bits.CANCAP = 0;
		#endif

		#if (MX_CAN_CHANNEL_X == 2)
			C2CTRL1bits.CANCAP = 0;
		#endif
	#endif

}

CALFUNCTION(void, FC_CAL_Internal_CAN_SendBuffer_, (MX_UINT8 buffer))
{
	unsigned int cantimeout = 0xFFFF;

	#ifdef __dsPIC30F__
		#if (MX_CAN_CHANNEL_X == 1)
			switch (buffer)
			{
				case 0:
					C1TX0CONbits.TXREQ = 1;							//Set Message Transmission Flag
					while (C1TX0CONbits.TXREQ && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
				case 1:
					C1TX1CONbits.TXREQ = 1;
					while (C1TX1CONbits.TXREQ && cantimeout)
						cantimeout = cantimeout - 1;
					break;
				case 2:
					C1TX2CONbits.TXREQ = 1;
					while (C1TX2CONbits.TXREQ && cantimeout)
						cantimeout = cantimeout - 1;
					break;
			}
		#endif

		#if (MX_CAN_CHANNEL_X == 2)
			switch (buffer)
			{
				case 0:
					C2TX0CONbits.TXREQ = 1;							//Set Message Transmission Flag
					while (C2TX0CONbits.TXREQ && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
				case 1:
					C2TX1CONbits.TXREQ = 1;
					while (C2TX1CONbits.TXREQ && cantimeout)
						cantimeout = cantimeout - 1;
					break;
				case 2:
					C2TX2CONbits.TXREQ = 1;
					while (C2TX2CONbits.TXREQ && cantimeout)
						cantimeout = cantimeout - 1;
					break;
			}
		#endif
	#else // __dsPIC30F__
		#if (MX_CAN_CHANNEL_X == 1)
			switch (buffer)
			{
				case 0:
					C1TR01CONbits.TXREQ0 = 1;
					while (C1TR01CONbits.TXREQ0 && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
				case 1:
					C1TR01CONbits.TXREQ1 = 1;
					while (C1TR01CONbits.TXREQ1 && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
				case 2:
					C1TR23CONbits.TXREQ2= 1;
					while (C1TR23CONbits.TXREQ2 && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
			}
		#endif

		#if (MX_CAN_CHANNEL_X == 2)
			switch (buffer)
			{
				case 0:
					C2TR01CONbits.TXREQ0= 1;
					while (C2TR01CONbits.TXREQ0 && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
				case 1:
					C2TR01CONbits.TXREQ1 = 1;
					while (C2TR01CONbits.TXREQ1 && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
				case 2:
					C2TR23CONbits.TXREQ2= 1;
					while (C2TR23CONbits.TXREQ2 && cantimeout)			//Wait for message to send
						cantimeout = cantimeout - 1;
					break;
			}
		#endif
	#endif


}

CALFUNCTION(MX_UINT8, FC_CAL_Internal_CAN_CheckRx_, (MX_UINT8 buffer))
{
	#if (MX_CAN_CHANNEL_X == 1)
		#ifdef __dsPIC30F__
			if (buffer == 0)
			{
				if (C1RX0CONbits.RXFUL)
				{
					MX_CAN_MSG_DLC_X = C1RX0DLC & 0x000F;	// Retrieve message length.
					MX_CAN_MSG_ID_X[0] = C1RX0SID >> 5;
					MX_CAN_MSG_ID_X[1] = C1RX0SID << 3;

					if(MX_CAN_MSG_DLC_X > 0)
					{
						MX_CAN_MSG_DATA_X[0] = C1RX0B1 & 0xFF;
						if(MX_CAN_MSG_DLC_X > 1)
						{
							MX_CAN_MSG_DATA_X[1] = C1RX0B1 >> 8;
							if(MX_CAN_MSG_DLC_X > 2)
							{
								MX_CAN_MSG_DATA_X[2] = C1RX0B2 & 0xFF;
								if(MX_CAN_MSG_DLC_X > 3)
								{
									MX_CAN_MSG_DATA_X[3] = C1RX0B2 >> 8;
									if(MX_CAN_MSG_DLC_X > 4)
									{
										MX_CAN_MSG_DATA_X[4] = C1RX0B3 & 0xFF;
										if(MX_CAN_MSG_DLC_X > 5)
										{
											MX_CAN_MSG_DATA_X[5] = C1RX0B3 >> 8;
											if(MX_CAN_MSG_DLC_X > 6)
											{
												MX_CAN_MSG_DATA_X[6] = C1RX0B4 & 0xFF;
												if(MX_CAN_MSG_DLC_X > 7)
												{
													MX_CAN_MSG_DATA_X[7] = C1RX0B4 >> 8;
												}
											}
										}
									}
								}
							}
						}
					}
					C1RX0CONbits.RXFUL = 0;
				}
				else
					return 0;
			}
			else
			{
				if (C1RX1CONbits.RXFUL)
				{
					MX_CAN_MSG_DLC_X = C1RX1DLC & 0x000F;	// Retrieve message length.
					MX_CAN_MSG_ID_X[0] = C1RX1SID >> 5;
					MX_CAN_MSG_ID_X[1] = C1RX1SID << 3;

					if(MX_CAN_MSG_DLC_X > 0)
					{
						MX_CAN_MSG_DATA_X[0] = C1RX1B1 & 0xFF;
						if(MX_CAN_MSG_DLC_X > 1)
						{
							MX_CAN_MSG_DATA_X[1] = C1RX1B1 >> 8;
							if(MX_CAN_MSG_DLC_X > 2)
							{
								MX_CAN_MSG_DATA_X[2] = C1RX1B2 & 0xFF;
								if(MX_CAN_MSG_DLC_X > 3)
								{
									MX_CAN_MSG_DATA_X[3] = C1RX1B2 >> 8;
									if(MX_CAN_MSG_DLC_X > 4)
									{
										MX_CAN_MSG_DATA_X[4] = C1RX1B3 & 0xFF;
										if(MX_CAN_MSG_DLC_X > 5)
										{
											MX_CAN_MSG_DATA_X[5] = C1RX1B3 >> 8;
											if(MX_CAN_MSG_DLC_X > 6)
											{
												MX_CAN_MSG_DATA_X[6] = C1RX1B4 & 0xFF;
												if(MX_CAN_MSG_DLC_X > 7)
												{
													MX_CAN_MSG_DATA_X[7] = C1RX1B4 >> 8;
												}
											}
										}
									}
								}
							}
						}
					}
					C1RX1CONbits.RXFUL = 0;
				}
				else
					return 0;
			}
			return 1;
		#else // __dsPIC30F__
			C1CTRL1bits.WIN = 0;

			// get ID of next FIFO buffer
			unsigned char id;
			if (buffer == 0)
			{
				id = 3;
			} else {
				id = C1FIFObits.FNRB;
			}

			unsigned int mask = 0x01 << id;
			if (C1RXFUL1 & mask) {
				#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
				int tmpdsr = DSRPAG;
				DSRPAG = __builtin_edspage (MX_MEMBUF_X);
				#endif

