BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
				MX_CAN_MSG_DLC_X = MX_MEMBUF_X[id][2] & 0x000F;	// Retrieve message length.
				// Message IDE flag
				if (MX_MEMBUF_X[id][0] & 1)
					// Extended ID
					MX_CAN_MSG_ID_X = (((MX_UINT32)MX_MEMBUF_X[id][0] & 0x1FFC) << 16)|(((MX_UINT32)MX_MEMBUF_X[id][1] & 0x0FFF) << 6)|((MX_MEMBUF_X[id][2] & 0xFC00) >> 10);
				else
					// Standard ID
					MX_CAN_MSG_ID_X = (MX_MEMBUF_X[id][0] >> 2) & 0b0000011111111111;

				// Always copy all data
				MX_CAN_MSG_DATA_X[0] = MX_MEMBUF_X[id][3] & 0xff;
				MX_CAN_MSG_DATA_X[1] = (MX_MEMBUF_X[id][3] >> 8) & 0xff;
				MX_CAN_MSG_DATA_X[2] = MX_MEMBUF_X[id][4] & 0xff;
				MX_CAN_MSG_DATA_X[3] = (MX_MEMBUF_X[id][4] >> 8) & 0xff;
				MX_CAN_MSG_DATA_X[4] = MX_MEMBUF_X[id][5] & 0xff;
				MX_CAN_MSG_DATA_X[5] = (MX_MEMBUF_X[id][5] >> 8) & 0xff;
				MX_CAN_MSG_DATA_X[6] = MX_MEMBUF_X[id][6] & 0xff;
				MX_CAN_MSG_DATA_X[7] = (MX_MEMBUF_X[id][6] >> 8) & 0xff;

				#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
				DSRPAG = tmpdsr;
				#endif
				// Empty buffer
				C1RXFUL1 &= ~ (mask);
			}
			else
				return 0;

			return 1;
		#endif // __dsPIC30F__
	#endif
	#if (MX_CAN_CHANNEL_X == 2)
		#ifdef __dsPIC30F__
			if (buffer == 0)
			{
				if (C2RX0CONbits.RXFUL)
				{
					MX_CAN_MSG_DLC_X = C2RX0DLC & 0x000F;	// Retrieve message length.
					MX_CAN_MSG_ID_X[0] = C2RX0SID >> 5;
					MX_CAN_MSG_ID_X[1] = C2RX0SID << 3;

					if(MX_CAN_MSG_DLC_X > 0)
					{
						MX_CAN_MSG_DATA_X[0] = C2RX0B1 & 0xFF;
						if(MX_CAN_MSG_DLC_X > 1)
						{
							MX_CAN_MSG_DATA_X[1] = C2RX0B1 >> 8;
							if(MX_CAN_MSG_DLC_X > 2)
							{
								MX_CAN_MSG_DATA_X[2] = C2RX0B2 & 0xFF;
								if(MX_CAN_MSG_DLC_X > 3)
								{
									MX_CAN_MSG_DATA_X[3] = C2RX0B2 >> 8;
									if(MX_CAN_MSG_DLC_X > 4)
									{
										MX_CAN_MSG_DATA_X[4] = C2RX0B3 & 0xFF;
										if(MX_CAN_MSG_DLC_X > 5)
										{
											MX_CAN_MSG_DATA_X[5] = C2RX0B3 >> 8;
											if(MX_CAN_MSG_DLC_X > 6)
											{
												MX_CAN_MSG_DATA_X[6] = C2RX0B4 & 0xFF;
												if(MX_CAN_MSG_DLC_X > 7)
												{
													MX_CAN_MSG_DATA_X[7] = C2RX0B4 >> 8;
												}
											}
										}
									}
								}
							}
						}
					}
					C2RX0CONbits.RXFUL = 0;
				}
				else
					return 0;
			}
			else
			{
				if (C2RX1CONbits.RXFUL)
				{
					MX_CAN_MSG_DLC_X = C2RX1DLC & 0x000F;	// Retrieve message length.
					MX_CAN_MSG_ID_X[0] = C2RX1SID >> 5;
					MX_CAN_MSG_ID_X[1] = C2RX1SID << 3;

					if(MX_CAN_MSG_DLC_X > 0)
					{
						MX_CAN_MSG_DATA_X[0] = C2RX1B1 & 0xFF;
						if(MX_CAN_MSG_DLC_X > 1)
						{
							MX_CAN_MSG_DATA_X[1] = C2RX1B1 >> 8;
							if(MX_CAN_MSG_DLC_X > 2)
							{
								MX_CAN_MSG_DATA_X[2] = C2RX1B2 & 0xFF;
								if(MX_CAN_MSG_DLC_X > 3)
								{
									MX_CAN_MSG_DATA_X[3] = C2RX1B2 >> 8;
									if(MX_CAN_MSG_DLC_X > 4)
									{
										MX_CAN_MSG_DATA_X[4] = C2RX1B3 & 0xFF;
										if(MX_CAN_MSG_DLC_X > 5)
										{
											MX_CAN_MSG_DATA_X[5] = C2RX1B3 >> 8;
											if(MX_CAN_MSG_DLC_X > 6)
											{
												MX_CAN_MSG_DATA_X[6] = C2RX1B4 & 0xFF;
												if(MX_CAN_MSG_DLC_X > 7)
												{
													MX_CAN_MSG_DATA_X[7] = C2RX1B4 >> 8;
												}
											}
										}
									}
								}
							}
						}
					}
					C2RX1CONbits.RXFUL = 0;
				}
				else
					return 0;
			}
			return 1;
		#else // __dsPIC30F__
			C2CTRL1bits.WIN = 0;

			// get ID of next FIFO buffer
			unsigned char id;
			if (buffer == 0)
			{
				id = 3;
			} else {
				id = C2FIFObits.FNRB;
			}

			unsigned int mask = 0x01 << id;
			if (C2RXFUL1 & mask) {
				#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
				int tmpdsr = DSRPAG;
				DSRPAG = __builtin_edspage (MX_MEMBUF_X);
				#endif

				MX_CAN_MSG_DLC_X = MX_MEMBUF_X[id][2] & 0x000F;	// Retrieve message length.
				// Message IDE flag
				if (MX_MEMBUF_X[id][0] & 1)
					// Extended ID
					MX_CAN_MSG_ID_X = (((MX_UINT32)MX_MEMBUF_X[id][0] & 0x1FFC) << 16)|(((MX_UINT32)MX_MEMBUF_X[id][1] & 0x0FFF) << 6)|((MX_MEMBUF_X[id][2] & 0xFC00) >> 10);
				else
					// Standard ID
					MX_CAN_MSG_ID_X = (MX_MEMBUF_X[id][0] >> 2) & 0b0000011111111111;

				// Always copy all data
				MX_CAN_MSG_DATA_X[0] = MX_MEMBUF_X[id][3] & 0xff;
				MX_CAN_MSG_DATA_X[1] = (MX_MEMBUF_X[id][3] >> 8) & 0xff;
				MX_CAN_MSG_DATA_X[2] = MX_MEMBUF_X[id][4] & 0xff;
				MX_CAN_MSG_DATA_X[3] = (MX_MEMBUF_X[id][4] >> 8) & 0xff;
				MX_CAN_MSG_DATA_X[4] = MX_MEMBUF_X[id][5] & 0xff;
				MX_CAN_MSG_DATA_X[5] = (MX_MEMBUF_X[id][5] >> 8) & 0xff;
				MX_CAN_MSG_DATA_X[6] = MX_MEMBUF_X[id][6] & 0xff;
				MX_CAN_MSG_DATA_X[7] = (MX_MEMBUF_X[id][6] >> 8) & 0xff;

				#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
				DSRPAG = tmpdsr;
				#endif
				// Empty buffer
				C2RXFUL1 &= ~ (mask);
			}
			else
				return 0;

			return 1;
		#endif // __dsPIC30F__
  	#endif

  return 0;
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxData_, (MX_UINT8 buffer, MX_UINT8 data_cnt, MX_UINT8 d0, MX_UINT8 d1, MX_UINT8 d2, MX_UINT8 d3, MX_UINT8 d4, MX_UINT8 d5, MX_UINT8 d6, MX_UINT8 d7))
{
	#ifdef __dsPIC30F__
		#if (MX_CAN_CHANNEL_X == 1)
			switch(buffer)
			{
				case 0:
					C1TX0DLC = data_cnt << 3;		// TX Buffer 0
					if (data_cnt > 0)
					{
					   C1TX0B1 = d0;
					   if (data_cnt > 1)
					   {
						   C1TX0B1 = C1TX0B1 | (d1 << 8);
						   if (data_cnt > 2)
						   {
							   C1TX0B2 = d2;
							   if (data_cnt > 3)
							   {
								   C1TX0B2 = C1TX0B2 | (d3 << 8);
								   if (data_cnt > 4)
								   {
									   C1TX0B3 = d4;
									   if (data_cnt > 5)
									   {
										   C1TX0B3 = C1TX0B3 | (d5 << 8);
										   if (data_cnt > 6)
										   {
											   C1TX0B4 = d6;
											   if (data_cnt > 7)
											   {
													C1TX0B4 = C1TX0B4 | (d7 << 8);
											   }
										   }
									   }
								   }
							   }
						   }
					   }
					}
					break;
				case 1:
					C1TX1DLC = data_cnt << 3;		// TX Buffer 1
					if (data_cnt > 0)
					{
					   C1TX1B1 = d0;
					   if (data_cnt > 1)
					   {
						   C1TX1B1 = C1TX1B1 | (d1 << 8);
						   if (data_cnt > 2)
						   {
							   C1TX1B2 = d2;
							   if (data_cnt > 3)
							   {
								   C1TX1B2 = C1TX1B2 | (d3 << 8);
								   if (data_cnt > 4)
								   {
									   C1TX1B3 = d4;
									   if (data_cnt > 5)
									   {
										   C1TX1B3 = C1TX1B3 | (d5 << 8);
										   if (data_cnt > 6)
										   {
											   C1TX1B4 = d6;
											   if (data_cnt > 7)
											   {
													C1TX1B4 = C1TX1B4 | (d7 << 8);
											   }
										   }
									   }
								   }
							   }
						   }
					   }
					}
					break;
				case 2:
					C1TX2DLC = data_cnt << 3;		// TX Buffer 0
					if (data_cnt > 0)
					{
					   C1TX2B1 = d0;
					   if (data_cnt > 1)
					   {
						   C1TX2B1 = C1TX2B1 | (d1 << 8);
						   if (data_cnt > 2)
						   {
							   C1TX2B2 = d2;
							   if (data_cnt > 3)
							   {
								   C1TX2B2 = C1TX2B2 | (d3 << 8);
								   if (data_cnt > 4)
								   {
									   C1TX2B3 = d4;
									   if (data_cnt > 5)
									   {
										   C1TX2B3 = C1TX2B3 | (d5 << 8);
										   if (data_cnt > 6)
										   {
											   C1TX2B4 = d6;
											   if (data_cnt > 7)
											   {
													C1TX2B4 = C1TX2B4 | (d7 << 8);
											   }
										   }
									   }
								   }
							   }
						   }
					   }
					}
					break;
			}
		#endif

		#if (MX_CAN_CHANNEL_X == 2)
			switch(buffer)
			{
				case 0:
					C2TX0DLC = data_cnt << 3;		// TX Buffer 0
					if (data_cnt > 0)
					{
					   C2TX0B1 = d0;
					   if (data_cnt > 1)
					   {
						   C2TX0B1 = C2TX0B1 | (d1 << 8);
						   if (data_cnt > 2)
						   {
							   C2TX0B2 = d2;
							   if (data_cnt > 3)
							   {
								   C2TX0B2 = C2TX0B2 | (d3 << 8);
								   if (data_cnt > 4)
								   {
									   C2TX0B3 = d4;
									   if (data_cnt > 5)
									   {
										   C2TX0B3 = C2TX0B3 | (d5 << 8);
										   if (data_cnt > 6)
										   {
											   C2TX0B4 = d6;
											   if (data_cnt > 7)
											   {
													C2TX0B4 = C2TX0B4 | (d7 << 8);
											   }
										   }
									   }
								   }
							   }
						   }
					   }
					}
					break;
				case 1:
					C2TX1DLC = data_cnt << 3;		// TX Buffer 1
					if (data_cnt > 0)
					{
					   C2TX1B1 = d0;
					   if (data_cnt > 1)
					   {
						   C2TX1B1 = C2TX1B1 | (d1 << 8);
						   if (data_cnt > 2)
						   {
							   C2TX1B2 = d2;
							   if (data_cnt > 3)
							   {
								   C2TX1B2 = C2TX1B2 | (d3 << 8);
								   if (data_cnt > 4)
								   {
									   C2TX1B3 = d4;
									   if (data_cnt > 5)
									   {
										   C2TX1B3 = C2TX1B3 | (d5 << 8);
										   if (data_cnt > 6)
										   {
											   C2TX1B4 = d6;
											   if (data_cnt > 7)
											   {
													C2TX1B4 = C2TX1B4 | (d7 << 8);
											   }
										   }
									   }
								   }
							   }
						   }
					   }
					}
					break;
				case 2:
					C2TX2DLC = data_cnt << 3;		// TX Buffer 0
					if (data_cnt > 0)
					{
					   C2TX2B1 = d0;
					   if (data_cnt > 1)
					   {
						   C2TX2B1 = C2TX2B1 | (d1 << 8);
						   if (data_cnt > 2)
						   {
							   C2TX2B2 = d2;
							   if (data_cnt > 3)
							   {
								   C2TX2B2 = C2TX2B2 | (d3 << 8);
								   if (data_cnt > 4)
								   {
									   C2TX2B3 = d4;
									   if (data_cnt > 5)
									   {
										   C2TX2B3 = C2TX2B3 | (d5 << 8);
										   if (data_cnt > 6)
										   {
											   C2TX2B4 = d6;
											   if (data_cnt > 7)
											   {
													C2TX2B4 = C2TX2B4 | (d7 << 8);
											   }
										   }
									   }
								   }
							   }
						   }
					   }
					}
					break;
			}
		#endif
	#else // __dsPIC30F__
		if (buffer < 3) {
			#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
			int tmpdsr = DSRPAG;
			DSRPAG = __builtin_edspage (MX_MEMBUF_X);
			#endif

