BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
			MX_MEMBUF_X[buffer][2] = (MX_MEMBUF_X[buffer][2] & 0xfff0) | (data_cnt & 0xf);
			MX_MEMBUF_X[buffer][3] = (d1 << 8) | d0;		// Transmit Data Bytes
			MX_MEMBUF_X[buffer][4] = (d3 << 8) | d2;
			MX_MEMBUF_X[buffer][5] = (d5 << 8) | d4;
			MX_MEMBUF_X[buffer][6] = (d7 << 8) | d6;

			#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
			DSRPAG = tmpdsr;
			#endif
		}
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxIdentStd_, (MX_UINT8 buffer, MX_UINT8 hi, MX_UINT8 lo))
{
	#ifdef __dsPIC30F__
		#if (MX_CAN_CHANNEL_X == 1)
			switch(buffer)
			{
				case 0:
					C1TX0SID = ((hi << 5) | (lo >> 3)) & 0x00FF;	//Transmit Buffer 0 S-ID
					C1TX0SID = C1TX0SID | ((hi << 8) & 0xFF00);
					break;
				case 1:
					C1TX1SID = ((hi << 5) | (lo >> 3)) & 0x00FF;	//Transmit Buffer 1 S-ID
					C1TX1SID = C1TX1SID | ((hi << 8) & 0xFF00);
					break;
				case 2:
					C1TX2SID = ((hi << 5) | (lo >> 3)) & 0x00FF;	//Transmit Buffer 2 S-ID
					C1TX2SID = C1TX2SID | ((hi << 8) & 0xFF00);
					break;
			}
		#endif
		#if (MX_CAN_CHANNEL_X == 2)
			switch(buffer)
			{
				case 0:
					C2TX0SID = ((hi << 5) | (lo >> 3)) & 0x00FF;	//Transmit Buffer 0 S-ID
					C2TX0SID = C2TX0SID | ((hi << 8) & 0xFF00);
					break;
				case 1:
					C2TX1SID = ((hi << 5) | (lo >> 3)) & 0x00FF;	//Transmit Buffer 1 S-ID
					C2TX1SID = C2TX1SID | ((hi << 8) & 0xFF00);
					break;
				case 2:
					C2TX2SID = ((hi << 5) | (lo >> 3)) & 0x00FF;	//Transmit Buffer 2 S-ID
					C2TX2SID = C2TX2SID | ((hi << 8) & 0xFF00);
					break;
			}
		#endif
	#else // __dsPIC30F__
		if (buffer < 3) {
			MX_MEMBUF_X[buffer][0] = (MX_CAN_TXB0ID_X << 2) & 0b0001111111111100;
		}
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxIdentExd_, (MX_UINT8 buffer, MX_UINT8 id3, MX_UINT8 id2, MX_UINT8 id1, MX_UINT8 id0))
{
	#if (MX_CAN_CHANNEL_X == 1)
		//Not Currently Supported!!
	#endif

	#if (MX_CAN_CHANNEL_X == 2)
   		//Not Currently Supported!!
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxFilterStd_, (MX_UINT8 filter, MX_UINT8 hi, MX_UINT8 lo))
{
	#if (MX_CAN_CHANNEL_X == 1)
		//Not Currently Supported!!
	#endif

	#if (MX_CAN_CHANNEL_X == 2)
   		//Not Currently Supported!!
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxFilterExd_, (MX_UINT8 filter, MX_UINT8 id3, MX_UINT8 id2, MX_UINT8 id1, MX_UINT8 id0))
{
	#if (MX_CAN_CHANNEL_X == 1)
		//Not Currently Supported!!
	#endif

	#if (MX_CAN_CHANNEL_X == 2)
   		//Not Currently Supported!!
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxMaskStd_, (MX_UINT8 filter, MX_UINT8 hi, MX_UINT8 lo))
{
	#if (MX_CAN_CHANNEL_X == 1)
		//Not Currently Supported!!
	#endif

	#if (MX_CAN_CHANNEL_X == 2)
   		//Not Currently Supported!!
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxMaskExd_, (MX_UINT8 filter, MX_UINT8 id3, MX_UINT8 id2, MX_UINT8 id1, MX_UINT8 id0))
{
	#if (MX_CAN_CHANNEL_X == 1)
		//Not Currently Supported!!
	#endif

	#if (MX_CAN_CHANNEL_X == 2)
   		//Not Currently Supported!!
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxMask_, (MX_UINT8 mask, MX_UINT32 id))
{
	#if (MX_CAN_CHANNEL_X == 1)
		#ifdef __dsPIC30F__
			MX_UINT16 sid;
			MX_UINT16 eih;
			MX_UINT16 eil;
			// change to config mode
			// Request config mode.
			C1CTRLbits.REQOP = REQOP_CONFIG;
			while( C1CTRLbits.OPMODE != REQOP_CONFIG );

			#if (MX_CAN_EXID_X == 1)
				sid = MX_CAN_RXESID(id);
				eih = MX_CAN_RXEIDH(id);
				eil = MX_CAN_RXEIDL(id);
			#else
				sid = MX_CAN_RXSSID(id);
				eih = -1;
				eil = -1;
			#endif
			switch(mask)
			{
				case 0:
					C1RXM0SID = sid;
					C1RXM0EIDH = eih;
					C1RXM0EIDL = eil;
					break;
				case 1:
					C1RXM1SID = sid;
					C1RXM1EIDH = eih;
					C1RXM1EIDL = eil;
					break;
			}
			// Request normal mode.
			C1CTRLbits.REQOP = REQOP_NORMAL;
			while( C1CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			// Request config mode.
			C1CTRL1bits.REQOP = REQOP_CONFIG;
			while( C1CTRL1bits.OPMODE != REQOP_CONFIG );

			/* Enable Window to Access Acceptance Filter Registers */
			C1CTRL1bits.WIN=0x1;

			switch (mask)
			{
				case 0:
			#if (MX_CAN_EXID_X == 1)
					C1RXM0SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXM0SIDbits.EID = (id >> 16) & 0x3;
					C1RXM0EIDbits.EID = (id & 0xffff);
			#else
					C1RXM0SIDbits.SID = id;
			#endif
					break;
				case 1:
			#if (MX_CAN_EXID_X == 1)
					C1RXM1SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXM1SIDbits.EID = (id >> 16) & 0x3;
					C1RXM1EIDbits.EID = (id & 0xffff);
			#else
					C1RXM1SIDbits.SID = id;
			#endif
					break;
			}

			/* Clear Window Bit to Access ECAN Control Registers */
			C1CTRL1bits.WIN=0x0;

			// Request normal mode.
			C1CTRL1bits.REQOP = REQOP_NORMAL;
			while( C1CTRL1bits.OPMODE != REQOP_NORMAL );
		#endif
	#endif
	#if (MX_CAN_CHANNEL_X == 2)
		#ifdef __dsPIC30F__
			MX_UINT16 sid;
			MX_UINT16 eih;
			MX_UINT16 eil;
			// change to config mode
			// Request config mode.
			C2CTRLbits.REQOP = REQOP_CONFIG;
			while( C2CTRLbits.OPMODE != REQOP_CONFIG );

			#if (MX_CAN_EXID_X == 1)
				sid = MX_CAN_RXESID(id);
				eih = MX_CAN_RXEIDH(id);
				eil = MX_CAN_RXEIDL(id);
			#else
				sid = MX_CAN_RXSSID(id);
				eih = -1;
				eil = -1;
			#endif
			switch(mask)
			{
				case 0:
					C2RXM0SID = sid;
					C2RXM0EIDH = eih;
					C2RXM0EIDL = eil;
					break;
				case 1:
					C2RXM1SID = sid;
					C2RXM1EIDH = eih;
					C2RXM1EIDL = eil;
					break;
			}
			// Request normal mode.
			C2CTRLbits.REQOP = REQOP_NORMAL;
			while( C2CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			// Request config mode.
			C2CTRL1bits.REQOP = REQOP_CONFIG;
			while( C2CTRL1bits.OPMODE != REQOP_CONFIG );

			/* Enable Window to Access Acceptance Filter Registers */
			C2CTRL1bits.WIN=0x1;

			switch (mask)
			{
				case 0:
			#if (MX_CAN_EXID_X == 1)
					C2RXM0SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXM0SIDbits.EID = (id >> 16) & 0x3;
					C2RXM0EIDbits.EID = (id & 0xffff);
			#else
					C2RXM0SIDbits.SID = id;
			#endif
					break;
				case 1:
			#if (MX_CAN_EXID_X == 1)
					C2RXM1SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXM1SIDbits.EID = (id >> 16) & 0x3;
					C2RXM1EIDbits.EID = (id & 0xffff);
			#else
					C2RXM1SIDbits.SID = id;
			#endif
					break;
			}

			/* Clear Window Bit to Access ECAN Control Registers */
			C2CTRL1bits.WIN=0x0;

			// Request normal mode.
			C2CTRL1bits.REQOP = REQOP_NORMAL;
			while( C2CTRL1bits.OPMODE != REQOP_NORMAL );
		#endif
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetRxFilter_, (MX_UINT8 filter, MX_UINT32 id))
{
	#if (MX_CAN_CHANNEL_X == 1)
		#ifdef __dsPIC30F__
			MX_UINT16 sid;
			MX_UINT16 eih;
			MX_UINT16 eil;
			// change to config mode
			// Request config mode.
			C1CTRLbits.REQOP = REQOP_CONFIG;
			while( C1CTRLbits.OPMODE != REQOP_CONFIG );

			#if (MX_CAN_EXID_X == 1)
				sid = MX_CAN_RXESID(id);
				eih = MX_CAN_RXEIDH(id);
				eil = MX_CAN_RXEIDL(id);
			#else
				sid = MX_CAN_RXSSID(id);
				eih = -1;
				eil = -1;
			#endif
			switch(filter)
			{
				case 0:
					C1RXF0SID = sid;
					C1RXF0EIDH = eih;
					C1RXF0EIDL = eil;
					break;
				case 1:
					C1RXF1SID = sid;
					C1RXF1EIDH = eih;
					C1RXF1EIDL = eil;
					break;
				case 2:
					C1RXF2SID = sid;
					C1RXF2EIDH = eih;
					C1RXF2EIDL = eil;
					break;
				case 3:
					C1RXF3SID = sid;
					C1RXF3EIDH = eih;
					C1RXF3EIDL = eil;
					break;
				case 4:
					C1RXF4SID = sid;
					C1RXF4EIDH = eih;
					C1RXF4EIDL = eil;
					break;
				case 5:
					C1RXF5SID = sid;
					C1RXF5EIDH = eih;
					C1RXF5EIDL = eil;
					break;
			}
			// Request normal mode.
			C1CTRLbits.REQOP = REQOP_NORMAL;
			while( C1CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			C1CTRL1bits.REQOP = REQOP_CONFIG;
			while( C1CTRL1bits.OPMODE != REQOP_CONFIG );

