BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
			// Switch to filter page
			C1CTRL1bits.WIN=0x1;

			#if (MX_CAN_EXID_X == 1)
			switch(filter)
			{
				case 0:
					C1RXF0SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXF0SIDbits.EID = (id >> 16) & 0x3;
					C1RXF0EIDbits.EID = (id & 0xffff);
					break;
				case 1:
					C1RXF1SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXF1SIDbits.EID = (id >> 16) & 0x3;
					C1RXF1EIDbits.EID = (id & 0xffff);
					break;
				case 2:
					C1RXF2SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXF2SIDbits.EID = (id >> 16) & 0x3;
					C1RXF2EIDbits.EID = (id & 0xffff);
					break;
				case 3:
					C1RXF3SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXF3SIDbits.EID = (id >> 16) & 0x3;
					C1RXF3EIDbits.EID = (id & 0xffff);
					break;
				case 4:
					C1RXF4SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXF4SIDbits.EID = (id >> 16) & 0x3;
					C1RXF4EIDbits.EID = (id & 0xffff);
					break;
				case 5:
					C1RXF5SIDbits.SID = (id >> 18) & 0x7ff;
					C1RXF5SIDbits.EID = (id >> 16) & 0x3;
					C1RXF5EIDbits.EID = (id & 0xffff);
			}
			#else
			switch(filter)
			{
				case 0:
					C1RXF0SIDbits.SID = id & 0x7ff;
					break;
				case 1:
					C1RXF1SIDbits.SID = id & 0x7ff;
					break;
				case 2:
					C1RXF2SIDbits.SID = id & 0x7ff;
					break;
				case 3:
					C1RXF3SIDbits.SID = id & 0x7ff;
					break;
				case 4:
					C1RXF4SIDbits.SID = id & 0x7ff;
					break;
				case 5:
					C1RXF5SIDbits.SID = id & 0x7ff;
			}
			#endif

			// Back to normal mode
			C1CTRL1bits.WIN=0x0;
			C1CTRL1bits.REQOP = REQOP_NORMAL;
			while( C1CTRL1bits.OPMODE != REQOP_NORMAL );
		#endif
	#endif
	#if (MX_CAN_CHANNEL_X == 2)
		#ifdef __dsPIC30F__
			MX_UINT16 sid;
			MX_UINT16 eih;
			MX_UINT16 eil;
			// change to config mode
			// Request config mode.
			C2CTRLbits.REQOP = REQOP_CONFIG;
			while( C2CTRLbits.OPMODE != REQOP_CONFIG );

			#if (MX_CAN_EXID_X == 1)
				sid = MX_CAN_RXESID(id);
				eih = MX_CAN_RXEIDH(id);
				eil = MX_CAN_RXEIDL(id);
			#else
				sid = MX_CAN_RXSSID(id);
				eih = -1;
				eil = -1;
			#endif
			switch(filter)
			{
				case 0:
					C2RXF0SID = sid;
					C2RXF0EIDH = eih;
					C2RXF0EIDL = eil;
					break;
				case 1:
					C2RXF1SID = sid;
					C2RXF1EIDH = eih;
					C2RXF1EIDL = eil;
					break;
				case 2:
					C2RXF2SID = sid;
					C2RXF2EIDH = eih;
					C2RXF2EIDL = eil;
					break;
				case 3:
					C2RXF3SID = sid;
					C2RXF3EIDH = eih;
					C2RXF3EIDL = eil;
					break;
				case 4:
					C2RXF4SID = sid;
					C2RXF4EIDH = eih;
					C2RXF4EIDL = eil;
					break;
				case 5:
					C2RXF5SID = sid;
					C2RXF5EIDH = eih;
					C2RXF5EIDL = eil;
					break;
			}
			// Request normal mode.
			C2CTRLbits.REQOP = REQOP_NORMAL;
			while( C2CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			C2CTRL1bits.REQOP = REQOP_CONFIG;
			while( C2CTRL1bits.OPMODE != REQOP_CONFIG );

			// Switch to filter page
			C2CTRL1bits.WIN=0x1;

			#if (MX_CAN_EXID_X == 1)
			switch(filter)
			{
				case 0:
					C2RXF0SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXF0SIDbits.EID = (id >> 16) & 0x3;
					C2RXF0EIDbits.EID = (id & 0xffff);
					break;
				case 1:
					C2RXF1SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXF1SIDbits.EID = (id >> 16) & 0x3;
					C2RXF1EIDbits.EID = (id & 0xffff);
					break;
				case 2:
					C2RXF2SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXF2SIDbits.EID = (id >> 16) & 0x3;
					C2RXF2EIDbits.EID = (id & 0xffff);
					break;
				case 3:
					C2RXF3SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXF3SIDbits.EID = (id >> 16) & 0x3;
					C2RXF3EIDbits.EID = (id & 0xffff);
					break;
				case 4:
					C2RXF4SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXF4SIDbits.EID = (id >> 16) & 0x3;
					C2RXF4EIDbits.EID = (id & 0xffff);
					break;
				case 5:
					C2RXF5SIDbits.SID = (id >> 18) & 0x7ff;
					C2RXF5SIDbits.EID = (id >> 16) & 0x3;
					C2RXF5EIDbits.EID = (id & 0xffff);
			}
			#else
			switch(filter)
			{
				case 0:
					C2RXF0SIDbits.SID = id & 0x7ff;
					break;
				case 1:
					C2RXF1SIDbits.SID = id & 0x7ff;
					break;
				case 2:
					C2RXF2SIDbits.SID = id & 0x7ff;
					break;
				case 3:
					C2RXF3SIDbits.SID = id & 0x7ff;
					break;
				case 4:
					C2RXF4SIDbits.SID = id & 0x7ff;
					break;
				case 5:
					C2RXF5SIDbits.SID = id & 0x7ff;
			}
			#endif

			C2CTRL1bits.WIN=0x0;
			C2CTRL1bits.REQOP = REQOP_NORMAL;
			while( C2CTRL1bits.OPMODE != REQOP_NORMAL );
		#endif
	#endif
}

CALFUNCTION(void, FC_CAL_Internal_CAN_SetTxIdent_, (MX_UINT8 buffer, MX_UINT32 id))
{
	#if (MX_CAN_CHANNEL_X == 1)
		#ifdef __dsPIC30F__
			// Request config mode.
			C1CTRLbits.REQOP = REQOP_CONFIG;
			while( C1CTRLbits.OPMODE != REQOP_CONFIG );

			#if (MX_CAN_EXID_X == 1)
			MX_UINT16 sid;
			MX_UINT16 eid;
			MX_UINT16 dlc;
			MX_UINT16 tmp;

			sid = MX_CAN_TXESID(id);
			eid = MX_CAN_TXEEID(id);
			dlc = MX_CAN_TXEDLC(id);

			switch(buffer)
			{
				case 0:
					tmp = C1TX0DLC & 0x78;
					C1TX0SID = sid;
					C1TX0EID = eid;
					C1TX0DLC = dlc | tmp;
					break;
				case 1:
					tmp = C1TX1DLC & 0x78;
					C1TX1SID = sid;
					C1TX1EID = eid;
					C1TX1DLC = dlc | tmp;
					break;
				case 2:
					tmp = C1TX2DLC & 0x78;
					C1TX2SID = sid;
					C1TX2EID = eid;
					C1TX2DLC = dlc | tmp;
					break;
			}
			#else
			switch(buffer)
			{
				case 0:
					C1TX0SID = MX_CAN_TXSSID(id);
					break;
				case 1:
					C1TX1SID = MX_CAN_TXSSID(id);
					break;
				case 2:
					C1TX2SID = MX_CAN_TXSSID(id);
					break;
			}
			#endif
			// Request normal mode.
			C1CTRLbits.REQOP = REQOP_NORMAL;
			while( C1CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			if (buffer < 3) {
				#if (MX_CAN_EXID_X == 1)
					#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
					int tmpdsr = DSRPAG;
					DSRPAG = __builtin_edspage (MX_MEMBUF_X);
					#endif

					MX_MEMBUF_X[buffer][0] = ((id >> 16) & 0b0001111111111100) | 0x01;
					MX_MEMBUF_X[buffer][1] = ((id >> 6 ) & 0b0000111111111111);
					MX_MEMBUF_X[buffer][2] = ((id & 0b111111) << 10) | (MX_MEMBUF_X[buffer][2] & 0xf);

					#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
					DSRPAG = tmpdsr;
					#endif
				#else
					MX_MEMBUF_X[buffer][0] = (id << 2) & 0b0001111111111100;
				#endif
			}
		#endif
	#endif
	#if (MX_CAN_CHANNEL_X == 2)
		#ifdef __dsPIC30F__
			// Request config mode.
			C2CTRLbits.REQOP = REQOP_CONFIG;
			while( C2CTRLbits.OPMODE != REQOP_CONFIG );

			#if (MX_CAN_EXID_X == 1)
			MX_UINT16 sid;
			MX_UINT16 eid;
			MX_UINT16 dlc;
			MX_UINT16 tmp;

