BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_CAN.c
			sid = MX_CAN_TXESID(id);
			eid = MX_CAN_TXEEID(id);
			dlc = MX_CAN_TXEDLC(id);

			switch(buffer)
			{
				case 0:
					tmp = C2TX0DLC & 0x78;
					C2TX0SID = sid;
					C2TX0EID = eid;
					C2TX0DLC = dlc | tmp;
					break;
				case 1:
					tmp = C2TX1DLC & 0x78;
					C2TX1SID = sid;
					C2TX1EID = eid;
					C2TX1DLC = dlc | tmp;
					break;
				case 2:
					tmp = C2TX2DLC & 0x78;
					C2TX2SID = sid;
					C2TX2EID = eid;
					C2TX2DLC = dlc | tmp;
					break;
			}
			#else
			switch(buffer)
			{
				case 0:
					C2TX0SID = MX_CAN_TXSSID(id);
					break;
				case 1:
					C2TX1SID = MX_CAN_TXSSID(id);
					break;
				case 2:
					C2TX2SID = MX_CAN_TXSSID(id);
					break;
			}
			#endif
			// Request normal mode.
			C2CTRLbits.REQOP = REQOP_NORMAL;
			while( C2CTRLbits.OPMODE != REQOP_NORMAL );
		#else // __dsPIC30F__
			if (buffer < 3) {
				#if (MX_CAN_EXID_X == 1)
					#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
					int tmpdsr = DSRPAG;
					DSRPAG = __builtin_edspage (MX_MEMBUF_X);
					#endif

					MX_MEMBUF_X[buffer][0] = ((id >> 16) & 0b0001111111111100) | 0x01;
					MX_MEMBUF_X[buffer][1] = ((id >> 6 ) & 0b0000111111111111);
					MX_MEMBUF_X[buffer][2] = ((id & 0b111111) << 10) | (MX_MEMBUF_X[buffer][2] & 0xf);

					#if defined (FCV_DMA_BASE) && defined(__dsPIC33E__)
					DSRPAG = tmpdsr;
					#endif
				#else
					MX_MEMBUF_X[buffer][0] = (id << 2) & 0b0001111111111100;
				#endif
			}
		#endif
	#endif
}

CALFUNCTION(MX_UINT32, FC_CAL_Internal_CAN_GetRxIdent_, (MX_UINT8 buffer))
{
#ifdef __dsPIC30F__
#if (MX_CAN_CHANNEL_X == 1)
		MX_UINT32 id = 0;
		MX_UINT32 sid = 0;
		MX_UINT32 eid = 0;
		MX_UINT32 dlc = 0;

		switch(buffer)
		{
			case 0:
				sid = C1RX0SID;
				eid = C1RX0EID;
				dlc = C1RX0DLC;
				break;
			case 1:
				sid = C1RX1SID;
				eid = C1RX1EID;
				dlc = C1RX1DLC;
				break;
		}
		if (sid & 1)
		{
			// Extended ID message
			id = ((dlc >> 10)& 0x3f) | ((eid << 6) & 0x3ffc0) | ((sid << 16) & 0x1ffc0000);
		}
		else
		{
			// Standard ID message
			id = (sid >> 2) & 0x7ff;
		}
		return id;
#endif
#if (MX_CAN_CHANNEL_X == 2)
	#ifndef dsPIC30	//Non dsPIC30F Device - Internal CAN different!!!
		#error "Internal CAN is not supported in the device type. dsPIC30 only supported."
	#endif
		MX_UINT32 id = 0;
		MX_UINT32 sid = 0;
		MX_UINT32 eid = 0;
		MX_UINT32 dlc = 0;

		switch(buffer)
		{
			case 0:
				sid = C2RX0SID;
				eid = C2RX0EID;
				dlc = C2RX0DLC;
				break;
			case 1:
				sid = C2RX1SID;
				eid = C2RX1EID;
				dlc = C2RX1DLC;
				break;
		}
		if (sid & 1)
		{
			// Extended ID message
			id = ((dlc >> 10)& 0x3f) | ((eid << 6) & 0x3ffc0) | ((sid << 16) & 0x1ffc0000);
		}
		else
		{
			// Standard ID message
			id = (sid >> 2) & 0x7ff;
		}
		return id;
#endif
#else // __dsPIC30F__
		return MX_CAN_MSG_ID_X;
#endif
}

CALFUNCTION(MX_UINT8, FC_CAL_Internal_CAN_GetRxDataCount_, (MX_UINT8 buffer))
{
	return (MX_CAN_MSG_DLC_X);
}

CALFUNCTION(MX_UINT8, FC_CAL_Internal_CAN_GetRxData_, (MX_UINT8 buffer, MX_UINT8 index))
{
	return (MX_CAN_MSG_DATA_X[index & 7]);
}

#endif
